package com.example.namazersomayosura.fragment_class;

import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.example.namazersomayosura.Adapter_Class.Allahr_name_Adapter;
import com.example.namazersomayosura.R;
import com.example.namazersomayosura.databinding.Allahr99NameBinding;

import java.util.ArrayList;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.databinding.DataBindingUtil;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

public class Allahr_99_Name_F extends Fragment {


    Allahr99NameBinding allahr99NameBinding;
    String allar_name_list[] = {
            "  الله (আল্লাহ) ",

            "  الرحمن (আর রাহমান)  ",

            "  الرحيم (আর-রহী'ম)  ",

            "   الملك (আল-মালিক)",

            "  القدوس (আল-কুদ্দুস)  ",
            "السلام(আস-সালাম)",
            "المؤمن (আল-মু'মিন)",
            "المهيمن (আল-মুহাইমিন)  ",
            "العزيز (আল-আ'জীজ)  ",
            "  الجبار (আল-জাব্বার)  ",


            " المتكبر (আল-মুতাকাব্বিইর)  ",
            " الخالق (আল-খালিক্ব)   ",
            " البارئ (আল-বারী )  ",
            "المصور (আল-মুছউইর)   ",
            "   الغفار (আল-গফ্ফার)   ",
            "القهار (আল-ক্বাহার)  ",
            "  الوهاب (আল-ওয়াহ্হাব)   ",
            " الرزاق (আর-রজ্জাক্ব)  ",
            " الفتاح (আল ফাত্তাহ)   ",
            " العليم (আল-আ'লীম)   ",

            "   القابض (আল-ক্ববিদ্ব')   ",
            "   الباسط (আল-বাসিত)   ",
            "   الخافض (আল-খফিদ্বু)   ",
            "   الرافع (আর-রফীই')   ",
            "   المعز (আল-মুই'জ্ব)  ",
            "   المذل (আল-মুদ্বি'ল্লু)    ",
            "   السميع (আস্-সামিই')   ",
            "   البصير (আল-বাছীর)  ",
            "   الحكم (আল-হা'কাম)  ",
            "   العدل (আল-আ'দল)   ",


            "   اللطيف (আল-লাতীফ)   ",
            "   الخبير (আল-খ'বীর)   ",
            "   الحليم (আল-হা'লীম)   ",
            "   العظيم (আল-আ'জীম)   ",
            "   الغفور (আল-গফুর)  ",
            "   الشكور (আশ্-শাকুর)   ",
            "   العلي (আল-আ'লিইউ)   ",
            "   الكبير (আল-কাবিইর)   ",
            "   الحفيظ (আল-হা'ফীজ)   ",
            "   المقيت (আল-মুক্বীত)   ",

            "   الحسيب (আল-হাসীব)   ",
            "   الجليل (আল-জালীল) ",
            "   الكريم (আল-কারীম)  ",
            "   الرقيب (আর-রক্বীব) ",
            "   المجيب (আল-মুজীব)  ",
            "   الواسع (আল-ওয়াসি')   ",
            "   الحكيم (আল-হাকীম)   ",
            "   الودود (আল-ওয়াদুদ)   ",
            "   المجيد (আল-মাজীদ)   ",
            "   الباعث (আল-বাই'ছ')  ",


            "   الشهيد(আশ্-শাহীদ)   ",

            "   الحق (আল-হা'ক্ব)   ",

            "   الوكيل (আল-ওয়াকিল)   ",

            "   القوي (আল-ক্বউইউ)   ",

            "   المتين (আল-মাতীন)  ",

            "   الولي (আল-ওয়ালিইউ)  ",

            "   الحميد (আল-হা'মীদ)  ",

            "   المحصي (আল-মুহছী)  ",

            "   المبدئ (আল-মুব্দি') ",

            "   المعيد (আল-মুঈ'দ)   ",

            "   المحيي (আল-মুহ'য়ী)   ",
            "   المميت (আল-মুমীত)   ",
            "   الحي (আল-হাইয়্যু)   ",
            "   القيوم (আল-ক্বাইয়্যুম)   ",
            "   الواجد (আল-ওয়াজিদ)   ",
            "   الماجد (আল-মাজিদ)   ",
            "   الواحد (আল-ওয়াহি'দ)   ",
            "   الصمد (আছ্-ছমাদ)  ",
            "   القادر (আল-ক্বদির)   ",
            "   المقتدر (আল-মুক্ব্তাদির)  ",

            "   المقدم (আল-মুক্বদ্দিম)  ",
            "   المؤخر (আল-মুয়াক্খির)  ",
            "  الأول (আল-আউয়াল)   ",
            "   الأخر (আল-আখির)  ",
            "   الظاهر(আজ-জ'হির)  ",
            "   الباطن (আল-বাত্বিন)  ",
            "   الوالي (আল-ওয়ালি)  ",
            "   المتعالي (আল-মুতাআ'লি)   ",
            "   البر (আল-বার্)  ",
            "  التواب (আত্-তাওয়াব)   ",

            "   المنتقم (আল-মুনতাক্বিম)  ",
            "   العفو (আল-আ'ফঊ)  ",
            "   الرؤوف (আর-রউফ)  ",
            "   مالك الملك (মালিকুল-মুলক)   ",
            "   ذو الجلال والإكرام (যুল-জালালি-ওয়াল-ইকরাম)  ",
            "   المقسط (আল-মুক্ব্সিত হকদারের)  ",
            "   الجامع (আল-জামিই')  ",
            "   الغني (আল-গণিই')  ",
            "   المغني (আল-মুগণিই')  ",
            "   المانع (আল-মানিই')  ",

            "   الضار (আয্-যর)  ",
            "   النافع (আন্-নাফিই')  ",
            "   النور (আন্-নূর)  ",
            "   الهادي (আল-হাদী)  ",
            "  البديع (আল-বাদীই')  ",
            "   الباقي (আল-বাক্বী)  ",
            "   الوارث (আল-ওয়ারিস')  ",
            "   الرشيد (আর-রাশীদ)  ",
            "  الصبور (আস-সবুর)"};

    String allar_namer_ortho_list[] = {

            "আল্লাহ",
            "পরম দয়ালু",
            "অতিশয়-মেহেরবান",
            "সর্বকর্তৃত্বময়",
            "নিষ্কলুষ, অতি পবিত্র",
            "  নিরাপত্তা-দানকারী, শান্তি-দানকারী  ",
            "   নিরাপত্তা ও ঈমান দানকারী   ",
            "  পরিপূর্ন রক্ষণাবেক্ষণকারী  ",
            "  পরাক্রমশালী, অপরাজেয়	  ",
            "  	দুর্নিবার  ",

            "   	নিরঙ্কুশ শ্রেষ্ঠত্বের অধিকারী   ",
            "   	সৃষ্টিকর্তা   ",
            "   সঠিকভাবে সৃষ্টিকারী   ",
            "   	আকৃতি-দানকারী   ",
            "   পরম ক্ষমাশীল   ",
            "   কঠোর   ",
            "   সবকিছু দানকারী   ",
            "   রিযিকদাতা   ",
            "   	বিজয়দানকারী   ",
            "   সর্বজ্ঞ   ",


            "   	সংকীর্ণকারী   ",
            "   	প্রশস্তকারী   ",
            "   অবনতকারী   ",
            "   	উন্নতকারী   ",
            "   সম্মান-দানকারী   ",
            "   (অবিশ্বাসীদের) বেইজ্জতকারী   ",
            "   সর্বশ্রোতা   ",
            "   সর্ববিষয়-দর্শনকারী   ",
            "   অটল বিচারক   ",
            "   পরিপূর্ণ-ন্যায়বিচারক   ",


            "   সকল-গোপন-বিষয়ে-অবগত   ",
            "   সকল ব্যাপারে জ্ঞাত   ",
            "   অত্যন্ত ধৈর্যশীল   ",
            "   সর্বোচ্চ-মর্যাদাশীল   ",
            "   পরম ক্ষমাশীল   ",
            "   গুনগ্রাহী   ",
            "   উচ্চ-মর্যাদাশীল   ",
            "   সুমহান   ",
            "   সংরক্ষণকারী   ",
            "   সকলের জীবনোপকরণ-দানকারী   ",

            "   হিসাব-গ্রহণকারী   ",
            "   পরম মর্যাদার অধিকারী   ",
            "   সুমহান দাতা   ",
            "   তত্ত্বাবধায়ক   ",
            "   জবাব-দানকারী, কবুলকারী   ",
            "   	সর্ব-ব্যাপী, সর্বত্র-বিরাজমান   ",
            "   পরম-প্রজ্ঞাময়   ",
            "   (বান্দাদের প্রতি) সদয়   ",
            "   	সকল-মর্যাদার-অধিকারী   ",
            "   পুনুরুজ্জীবিতকারী   ",

            "   সর্বজ্ঞ-স্বাক্ষী   ",
            "   পরম সত্য   ",
            "   পরম নির্ভরযোগ্য কর্ম-সম্পাদনকারী   ",
            "   পরম-শক্তির-অধিকারী	   ",
            "   সুদৃঢ়   ",
            "   অভিভাবক ও সাহায্যকারী   ",
            "   সকল প্রশংসার অধিকারী   ",
            "   সকল সৃষ্টির ব্যপারে অবগত   ",
            "   প্রথমবার-সৃষ্টিকর্তা    ",
            " পুনরায়-সৃষ্টিকর্তা   ",

            "জীবন-দানকারী   ",
            "মৃত্যু-দানকারী   ",
            " চিরঞ্জীব  ",
            "সমস্তকিছুর ধারক ও সংরক্ষণকারী   ",
            " অফুরন্ত ভান্ডারের অধিকারী  ",
            " শ্রেষ্ঠত্বের অধিকারী  ",
            "   এক ও অদ্বিতীয়  ",
            "   অমুখাপেক্ষী	  ",
            "   সর্বশক্তিমান  ",
            "   নিরঙ্কুশ-সিদ্বান্তের-অধিকারী  ",


            "   অগ্রসারক  ",
            "  অবকাশ দানকারী    ",
            "  অনাদি   ",
            "  অনন্ত, সর্বশেষ   ",
            "  	সম্পূর্নরূপে-প্রকাশিত   ",
            "   দৃষ্টি হতে অদৃশ্য  ",
            "  সমস্ত-কিছুর-অভিভাবক   ",
            "   সৃষ্টির গুনাবলীর উর্দ্ধে  ",
            "  পরম-উপকারী, অণুগ্রহশীল    ",
            "   তাওবার তাওফিক দানকারী এবং কবুলকারী  ",
            "   প্রতিশোধ-গ্রহণকারী   ",
            "   পরম-উদার   ",
            "   পরম-স্নেহশীল   ",
            "   সমগ্র জগতের বাদশাহ্   ",
            "   	মহিমান্বিত ও দয়াবান সত্তা   ",
            "    হক-আদায়কারী   ",
            "   	একত্রকারী, সমবেতকারী   ",
            "   অমুখাপেক্ষী ধনী   ",
            "   পরম-অভাবমোচনকারী   ",
            "   অকল্যানরোধক   ",

            "  ক্ষতিসাধনকারী   ",
            "  	কল্যাণকারী   ",
            "   পরম-আলো	   ",
            "  পথ-প্রদর্শক    ",
            "   অতুলনীয়  ",
            "  চিরস্থায়ী, অবিনশ্বর    ",
            "   উত্তরাধিকারী  ",
            "  সঠিক পথ-প্রদর্শক    ",
            "   অত্যধিক ধৈর্যধারণকারী  "
    };


    @Nullable
    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, @Nullable ViewGroup container, @Nullable Bundle savedInstanceState) {
        allahr99NameBinding = DataBindingUtil.inflate(inflater, R.layout.allahr_99_name, container, false);
        View view = allahr99NameBinding.getRoot();
        getActivity().setTitle("আল্লাহ্‌র গুণবাচক নাম সমূহ");
        return view;

    }

    @Override
    public void onViewCreated(@NonNull View view, @Nullable Bundle savedInstanceState) {
        super.onViewCreated(view, savedInstanceState);


        Allahr_name_Adapter allahr_name_adapter = new Allahr_name_Adapter(getContext(), allar_name_list, allar_namer_ortho_list);
        allahr99NameBinding.namleListRecyclerViewID.setAdapter(allahr_name_adapter);

       /* LinearLayoutManager linearLayoutManager = new LinearLayoutManager(getContext());
        linearLayoutManager.setOrientation(RecyclerView.VERTICAL);
        allahr99NameBinding.namleListRecyclerViewID.setLayoutManager(linearLayoutManager);
        Allahr_name_Adapter allahr_name_adapter = new Allahr_name_Adapter(getContext(), allar_name_list, allar_namer_ortho_list);

        allahr99NameBinding.namleListRecyclerViewID.setAdapter(allahr_name_adapter);
        allahr_name_adapter.setOnItemClickListener(new Allahr_name_Adapter.ClickListener() {
            @Override
            public void onItemClick(int position, View v) {

            }

            @Override
            public void onItemLongClick(int position, View v) {

            }
        });*/


    }
}
