package com.example.namazersomayosura.fragment_class;

import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.databinding.DataBindingUtil;
import androidx.fragment.app.Fragment;

import com.example.namazersomayosura.R;
import com.example.namazersomayosura.databinding.HadithDetailsFBinding;

public class Hadith_details_F extends Fragment {

    String hadith_Salat = "ফজরের নামাযের ৮ উপকারীতা।\n" +
            "হাদিস শরিফে এসেছে-\n" +
            "(১) ফজরের নামাজে দাঁড়ানো, সারা রাত দাঁড়িয়ে নামাজ পড়ার সমান। 'যে ব্যক্তি জামাতের সাথে এশার নামাজ আদায় করলো, সে যেন অর্ধেক রাত জেগে নামাজ পড়লো। আর যে ব্যক্তি ফজরের নামাজ জামাতের সাথে পড়লো, সে যেন পুরো রাত জেগে নামাজ পড়লো।' (মুসলিম শরিফ)\n" +
            "\n" +
            "(২) 'যে ব্যক্তি ফজরের নামাজ পড়বে, সে আল্লাহর জিম্মায় থাকবে।' (মুসলিম)\n" +
            "\n" +
            "(৩) ফজরের নামায কেয়ামতের দিন নূর হয়ে দেখা দিবে-\n" +
            "'যারা রাতের আঁধারে মসজিদের দিকে হেঁটে যায়, তাদেরকে কেয়ামতের দিন পরিপূর্ণ নূর প্রাপ্তির সুসংবাদ দাও।' (আবু দাউদ)\n" +
            "\n" +
            "(৪) সরাসরি জান্নাত প্রাপ্তি-\n" +
            "'যে ব্যক্তি দুই শীতল (নামাজ) পড়বে, জান্নাতে প্রবেশ করবে। আর দুই শীতল (নামাজ) হলো ফজর ও আসর।' (বুখারী)\n" +
            "\n" +
            "৫.আবূ হুরাইরা (রাঃ) কর্তৃক বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা তোমাদের গৃহসমূহকে কবর বানিয়ে নিয়ো না।\n" +
            "\n" +
            "৬.আবূ সাঈদ খুদরী (রাঃ) কর্তৃক বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কবরস্থান, প্রস্রাব-পায়খানা ও গোসল করার স্থান ছাড়া পৃথিবীর সমস্ত জায়গাই মসজিদ। (তাতে নামায পড়া চলে।)\n" +
            "(আবূ দাঊদ ৪৯২, তিরমিযী ৩১৭, ইবনে মাজাহ ৭৪৫ প্রমুখ)\n" +
            "\n" +
            "৭.জুনদুব কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সাবধান! তোমরা কবরগুলোকে মসজিদ বানিয়ে নিয়ো না। এরূপ করতে আমি তোমাদেরকে নিষেধ করছি।\n" +
            "(মুসলিম ১২১৬)\n" +
            "\n" +
            "৮.আবূ মারসাদ কান্নায ইবনে হুসাইন (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, তোমরা কবরের দিকে মুখ করে নামায পড়ো না এবং তার উপর বসো না।\n" +
            "(মুসলিম ২২৯৫, নাসাঈ ৭৬০)\n" +
            "\n" +
            "৯.উসমান বিন আফফান (রাঃ) কর্তৃক বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি আল্লাহর (সন্তুষ্টি লাভের) উদ্দেশ্যে একটি মসজিদ নির্মাণ করে দেয়, আল্লাহ তার জন্য জান্নাতে একটি ঘর বানিয়ে দেন।\n" +
            "(বুখারী ৪৫০, মুসলিম ১২১৭, মিশকাত ৬৯৭)\n" +
            "\n" +
            "১০.আয়েশা (রাঃ) হতে বর্ণিত, একদা আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কিবলার দিকের দেওয়ালে পোঁটা, থুথু কিংবা শ্লেষ্মা দেখতে পেলেন। সুতরাং তিনি রগড়ে পরিষ্কার করে দিলেন।\n" +
            "(বুখারী ৪০৭, মুসলিম ১২৫৫)\n" +
            "\n" +
            "১১.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, তিনি আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছেন, যে ব্যক্তি কাউকে হারানো জিনিস সন্ধান (ঘোষণা) করতে শোনে, সে যেন বলে, আল্লাহ যেন তোমাকে তা ফিরিয়ে না দেন। কারণ, মসজিদ এর জন্য বানানো হয়নি।\n" +
            "(মুসলিম ১২৮৮)\n" +
            "\n" +
            "১২.আয়েশা (রাঃ) বলেন, 'আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মহল্লায় মসজিদ নির্মাণ করতে এবং তা পরিষ্কার ও সুগন্ধময় করে রাখতে আদেশ করেছেন।\n" +
            "(আহমাদ, আবূ দাঊদ ৪৫৫, তিরমিযী ৫৯৪, ইবনে মাজাহ ৭৫৮, ইবনে খুযাইমা ১২৯৪,, ইবনে হিব্বান ১৬৩৪)\n" +
            "\n" +
            "১৩.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, লোকেরা যদি জানত যে, আযান দেওয়া ও নামাযের প্রথম সারিতে দাঁড়াবার কী মাহাত্ম্য আছে, অতঃপর (তাতে অংশগ্রহণের জন্য) যদি লটারি ব্যতিরেকে অন্য কোন উপায় না পেত, তবে তারা অবশ্যই সে ক্ষেত্রে লটারির সাহায্য নিত। (অনুরূপ) তারা যদি জানত যে, আগে আগে মসজিদে আসার কি ফযীলত, তাহলে তারা সে ব্যাপারে প্রতিযোগিতা করত। আর তারা যদি জানত যে, এশা ও ফজরের  নামায (জামাতে) পড়ার ফযীলত কত বেশি, তাহলে মাটিতে হামাগুড়ি দিয়ে বা পাছা ছেঁচড়ে আসতে হলেও তারা অবশ্যই আসত।\n" +
            "(বুখারী ৬১৫, মুসলিম ১০০৯)\n" +
            "\n" +
            "১৪.মুআবিয়াহ ইবনে আবূ সুফয়ান (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ কথা বলতে শুনেছি, কিয়ামতের দিনে সমস্ত লোকের চাইতে মুআযযিনদের গর্দান লম্বা হবে।\n" +
            "(মুসলিম ৮৭৮)\n" +
            "\n" +
            "১৫.বারা' বিন আযেব (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, আল্লাহ প্রথম কাতারের (নামাযীদের) উপর রহমত বর্ষণ করেন এবং ফিরিশতাগণ তাদের জন্য ক্ষমা প্রার্থনা করে থাকেন। মুআযযিনকে তার আযানের আওয়াযের উচ্চতা অনুযায়ী ক্ষমা করা হয়। তার আযান শ্রবণকারী প্রত্যেক সরস বা নীরস বস্তু তার কথার সত্যায়ন করে থাকে। তার সাথে যারা নামায পড়ে তাদের সকলের নেকীর সমপরিমাণ তার নেকী লাভ হয়।\n" +
            "(আহমাদ ১৮৫০৬, নাসাঈ ৬৪৬, সহীহ তারগীব ২৩৫)\n" +
            "\n" +
            "১৬.আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন তোমরা আযান ধ্বনি শুনবে, তখন (আযানের উত্তরে) মুআযযিন যা কিছু বলবে, তোমরাও ঠিক তাই বলো।\n" +
            "(বুখারী ৬১১, মুসলিম ৮৭৪)\n" +
            "\n" +
            "১৭.আনাস (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আযান ও ইকামতের মধ্য সময়ে কৃত প্রার্থনা রদ করা হয় না। (অর্থাৎ, এ সময়ের দু'আ কবুল হয়)।\n" +
            "(আবূ দাঊদ ৫২১, তিরমিযী ২১২, ৩৫৯৫, হাসান)\n" +
            "\n" +
            "১৮.আব্দুল্লাহ ইবনে উমার (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ইসলামের ভিত্তি পাঁচটি জিনিসের উপর প্রতিষ্ঠিত। (১) এই কথার সাক্ষ্য দেওয়া যে, আল্লাহ ছাড়া কোন সত্য উপাস্য নেই এবং মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আল্লাহর প্রেরিত মহাপুরুষ। (২) নামায প্রতিষ্ঠা করা। (৩) যাকাত প্রদান করা। (৪) কা'বাগৃহের হজ্জ করা। (৫) রমযান মাসে রোযা পালন করা।\n" +
            "(বুখারী ৮, মুসলিম ১২২)\n" +
            "\n" +
            "১৯.জাবের (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, মানুষ ও কুফরীর মধ্যে (পর্দা) হল, নামায ত্যাগ করা।\n" +
            "(মুসলিম ২৫৬)\n" +
            "\n" +
            "২০.বুরাইদাহ (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে চুক্তি আমাদের ও তাদের (কাফেরদের) মধ্যে বিদ্যমান, তা হচ্ছে নামায (পড়া)। অতএব যে নামায ত্যাগ করবে, সে নিশ্চয় কাফের হয়ে যাবে।\n" +
            "(আহমাদ ২২৯৩৭, তিরমিযী ২৬২১, নাসাঈ ৪৬৩, ইবনে মাজাহ ১০৭৯, ইবনে হিব্বান ১৪৫৪, হাকেম ১১, সহীহ তারগীব ৫৬১)\n" +
            "\n" +
            "২১.নাওফাল বিন মুআবিয়া (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যে ব্যক্তির কোন নামায ছুটে গেল, সে ব্যক্তির পরিবার ও ধন-সম্পদ যেন লুণ্ঠন হয়ে গেল।\n" +
            "(ইবনে হিব্বান ১৪৬৮, সহীহ তারগীব ৫৭৭)\n" +
            "\n" +
            "২২.ইবনে মাসউদ (রাঃ) হতে বর্ণিত, তিনি বলেন, যে ব্যক্তি নামায ত্যাগ করে, তার দ্বীনই নেই।\n" +
            "(ইবনে আবী শাইবাই ৭৬৩৭, ৩০৩৯৭, ত্বাবারানীর কাবীর ৮৮৪৭-৮৮৪৮, বাইহাক্বীর শুআবুল ঈমান ৪৩, সহীহ তারগীব ৫৭৪)\n" +
            "\n" +
            "২৩.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, তিনি বলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, নিশ্চয় কিয়ামতের দিন বান্দার (হক্বুক্বুল্লাহর মধ্যে) যে কাজের হিসাব সর্বপ্রথম নেওয়া হবে তা হচ্ছে তার নামায। সুতরাং যদি তা সঠিক হয়, তাহলে সে পরিত্রাণ পাবে। আর যদি (নামায) পণ্ড ও খারাপ হয়, তাহলে সে ব্যর্থ ও ক্ষতিগ্রস্ত হবে। যদি তার ফরয (ইবাদতের) মধ্যে কিছু কম পড়ে যায়, তাহলে প্রভু বলবেন, দেখ তো! আমার বান্দার কিছু নফল (ইবাদত) আছে কি না, যা দিয়ে ফরযের ঘাটতি পূরণ করে দেওয়া হবে? অতঃপর তার অবশিষ্ট সমস্ত আমলের হিসাব ঐভাবে গৃহীত হবে।\n" +
            "(তিরমিযী ৪১৩, আবূ দাঊদ ৮৬৪, হাসান)\n" +
            "\n" +
            "২৪.আমর বিন শুআইব (রহঃ) নিজ পিতা ও তিনি তাঁর দাদা হতে বর্ণনা করে বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমাদের সন্তানদের বয়স সাত বছর হলে তাদেরকে নামায শিক্ষা দাও এবং দশ বছর হলে তার (নামাযের) উপর তাদেরকে প্রহার কর। আর বিছানায় তাদের মাঝে তফাৎ কর।\n" +
            "(আবূ দাঊদ ৪৯৫, সহীহুল জামে' ৫৮৬৮)\n" +
            "\n" +
            "২৫.আনাস (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমাদের দুনিয়ার মধ্যে আমার কাছে স্ত্রী ও খোশবুকে প্রিয় করা হয়েছে। আর নামাযকে করা হয়েছে আমার চক্ষুশীতলতা।\n" +
            "(আহমাদ ১২২৯৩, নাসাঈ ৩৯৩৯, হাকেম ২৬৭৬, সহীহুল জামে' ৩১২৪)\n" +
            "\n" +
            "২৬.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আদম-সন্তান এমন কোন কাজ করেনি, যা নামায, সদ্ভাব প্রতিষ্ঠা ও সচ্চরিত্রতা থেকে অধিক শ্রেষ্ঠ হতে পারে।\n" +
            "(বুখারী তারীখ, বাইহাক্বীর শুআবুল ঈমান ১১০৯১, সিলসিলা সহীহাহ ১৪৪৮)\n" +
            "\n" +
            "২৭.আব্দুল্লাহ বিন আমর (রাঃ) বলেন, এক ব্যক্তি আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে জিজ্ঞাসা করল, সর্বশ্রেষ্ঠ আমল কী? উত্তরে তিনি বললেন, নামায। সে আবার বলল, তারপর কী? তিনি বললেন, নামায। সে আবার বলল, তারপর কী? তিনি বললেন, নামায। এইরূপ তিনবার বললেন।\n" +
            "(আহমাদ ৬৬০২, ইবনে হিব্বান ১৭২২, সহীহুত তারগীব ৩৭৮)\n" +
            "\n" +
            "২৮. আবূ হুরাইরা (রাঃ) হতে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ কথা বলতে শুনেছেন, আচ্ছা তোমরা বল তো, যদি কারোর বাড়ির দরজার সামনে একটি নদী থাকে, যাতে সে প্রতিদিন পাঁচবার ক'রে গোসল করে, তাহলে তার শরীরে কোন ময়লা অবশিষ্ট থাকবে কি? সাহাবীরা বললেন, (না,) কোন ময়লা অবশিষ্ট থাকবে না। তিনি বললেন, পাঁচ ওয়াক্তের নামাযের উদাহরণও সেইরূপ। এর দ্বারা আল্লাহ পাপরাশি নিশ্চিহ্ন করে দেন।\n" +
            "(বুখারী ৫২৮, মুসলিম ১৫৫৪, তিরমিযী ২৮৬৮, নাসাঈ ৪৬২)\n" +
            "\n" +
            "২৯.জাবের (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, পাঁচ ওয়াক্তের নামাযের উদাহরণ ঠিক প্রবাহিত নদীর ন্যায়, যা তোমাদের কোন ব্যক্তির দরজার পাশে থাকে; যাতে সে প্রত্যহ পাঁচবার করে গোসল করে থাকে।\n" +
            "(মুসলিম ১৫৫৫)\n" +
            "\n" +
            "২৩.আবূ মূসা (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি দুই ঠাণ্ডা নামায পড়ে, সে জান্নাত প্রবেশ করবে।\n" +
            "(বুখারী ৫৭৪, মুসলিম ১৪৭০)\n" +
            "\n" +
            "৩১.আবূ যুহাইর উমারাহ ইবনে রুআইবাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি যে, যে ব্যক্তি সূর্যোদয় ও সূর্যাস্তের পূর্বে (অর্থাৎ ফজরের ও আসরের নামায) আদায় করবে, সে কখনো জাহান্নামে প্রবেশ করবে না।\n" +
            "(মুসলিম ১৪৬৮)\n" +
            "\n" +
            "৩২.জুনদুব ইবনে সুফয়ান (রাঃ) কর্তৃক বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি ফজরের নামায পড়ল, সে আল্লাহর জামানত লাভ করল। অতএব হে আদম সন্তান! লক্ষ্য রাখ, আল্লাহ যেন অবশ্যই তোমাদের কাছে তার জামানতের কিছু দাবী না করেন।\n" +
            "(মুসলিম ১৫২৫-১৫২৬)\n" +
            "\n" +
            "৩৩.\"যে ব্যক্তি রাতের নামাযে (তাহাজ্জুদে) দাঁড়িয়ে অন্তত ১০ আয়াত পড়বে তাঁকে গাফেলদের (অলসদের) অন্তর্ভুক্ত ধরা হবে না।।\n" +
            "আর যে ১০০ আয়াত তিলাওয়াত করবে তাঁকে আনুগত্যশীলদের অন্তর্ভুক্ত গন্য করা হবে।।\n" +
            "আর যে ১০০০ আয়াত তিলাওয়াত করবে তাঁকে পুণ্যবানদের মাঝে সফলকাম গন্য করা হবে।।\"রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত হাদিস।\n" +
            "[আবু দাউদ, মিশকাত; হাদিস নং- ১১৩০]";

    String hadith_Siam = "1.\" যদি কেউ তার মুসলিম ভাইকে ইফতার করায়,(তবে) সে তার সমান সওয়াব পায়।(অবশ্য) যাকে ইফতার করানো হচ্ছে তার সওয়াব একটুও কমানো হয় না।\" (ইবনে-মাজাহ) \n" +
            "\n" +
            "2.আল্লাহর রাসূল (সা:) বলেছেনঃ \"জিবরাঈল (আঃ) আমাকে বলেছেন, আল্লাহ্ ঐ ব্যক্তির নাক মাটিতে ঘষুন যার নিকট রামাদান আসল এবং তার গুনাহসমূহ মাফ হল না, এবং আমি বললাম, আমিন। তারপর তিনি বললেন, আল্লাহ ঐ ব্যক্তির নাকও মাটিতে ঘষুন যে জীবদ্দশায় তার পিতামাতার একজনকে অথবা উভয়কে বৃদ্ধ হতে দেখল এবং সে জান্নাতে প্রবেশ করার অধিকার রাখল না তাদের সেবা করার মাধ্যমে আর আমি বললাম, আমিন।\n" +
            "\n" +
            "3.অতঃপর তিনি বললেন: আল্লাহ্ ঐ ব্যক্তির নাক মাটিতে ঘষুন যার উপস্থিতিতে যখন আপনার নাম উচ্চারণ করা হয় তখন সে আপনার প্রতি সালাম বর্ষণ করে না আর আমি বললাম, আমিন।\" [তিরমিযী, আহমাদ, এবং অন্যান্য_আলবানী কর্তৃক সহীহকৃত]\n" +
            "\n" +
            "4.আবু হুরাইরা (রাঃ) কর্তৃক বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ''রমযান উপস্থিত হলে জান্নাতের দ্বারসমূহকে উন্মুক্ত করা হয়, দোযখের দ্বারসমূহকে রুদ্ধ করে দেওয়া হয়, আর সকল শয়তানকে করা হয় শৃঙ্খলিত।'' (বুখারী ১৮৯৯, ৩২৭৭, মুসলিম ২৫৪৭)\n" +
            "\n" +
            "5.আবু উমামাহ (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, প্রত্যহ ইফতারী করার সময় আল্লাহ বহু মানুষকেই দোযখ থেকে মুক্তিদান করে থাকেন।(আহমাদ ২২২০২, ত্বাবারানী ৮০১৪, বাইহাক্বীর শুআবুল ঈমান ৩৬০৫, সহীহ তারগীব ১০০১)\n" +
            "\n" +
            "6.আয়েশা (রাঃ) হতে বর্ণিত, তিনি বলেন, (রমযানের) শেষ দশক প্রবেশ করলে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্বয়ং রাতে জাগতেন এবং পরিবার-পরিজনদেরকেও জাগাতেন। আর (ইবাদতের জন্য) কোমর বেঁধে নিতেন।\n" +
            "(বুখারী ২০২৪, মুসলিম ২৮৪৪)\n" +
            "\n" +
            "7.আবূ হুরাইরা (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি ঈমান সহকারে নেকীর আশায় রমযানের সিয়াম পালন করে, তার অতীতের গুনাহসমূহ ক্ষমা ক'রে দেওয়া হয়।\n" +
            "(বুখারী ৩৮, মুসলিম ১৮১৭)\n" +
            "\n" +
            "8.আবু সাঈদ (রাঃ) কর্তৃক বর্ণিত, তিনি বলেন, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যে বান্দা আল্লাহর রাস্তায় একদিন মাত্র সিয়াম রাখবে সেই বান্দাকে আল্লাহ ঐ সিয়ামের বিনিময়ে জাহান্নাম থেকে ৭০ বছরের পথ পরিমাণ দূরত্বে রাখবেন।\n" +
            "(বুখারী ২৮৪০, মুসলিম ১১৫৩)\n" +
            "\n" +
            "9.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন তোমাদের কারো সিয়ামের দিন হবে, সে যেন অশ্লীল ভাষা প্রয়োগ না করে ও হৈ-হট্টগোল না করে। আর যদি কেউ গালাগালি করে অথবা তার সাথে লড়াই ঝগড়া করে, তাহলে সে যেন বলে যে, আমি সিয়াম পালনকারী।\n" +
            "(বুখারী ১৯০৪, মুসলিম ২৭৬২)\n" +
            "\n" +
            "10.আবূ হুরায়রা (রাঃ)হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন কোন ব্যক্তি মিথ্যা কথা বলা ও তার উপর আমল করা পরিহার না করল, তখন আল্লাহর কোন দরকার নেই যে, সে তার পানাহার ত্যাগ করুক।\n" +
            "(বুখারী ১৯০৩, ৬০৫৭)\n" +
            "\n" +
            "11.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখন কোন ব্যক্তি ভুলবশতঃ কিছু খেয়ে বা পান করে ফেলবে, তখন সে যেন তার সিয়াম (না ভেঙ্গে) পূর্ণ করে নেয়। কেননা, আল্লাহই তাকে খাইয়েছেন এবং পান করিয়েছেন।\n" +
            "(বুখারী ১৯৩৩, ৬৬৬৯, মুসলিম ২৭৭২)\n" +
            "\n" +
            "12.আবূ হুরাইরা (রাঃ) কর্তৃক বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা চাঁদ দেখে সিয়াম রাখ এবং চাঁদ দেখে সিয়াম ছাড়। যদি (কালক্রমে) তোমাদের উপর আকাশ মেঘাচ্ছন্ন হয় (এবং চাঁদ দেখতে না পাওয়া যায়), তাহলে শা'বান (মাসের) গুনতি ত্রিশ পূর্ণ করে নাও।\n" +
            "মুসলিমের এক বর্ণনায় আছে, তোমাদের আকাশ মেঘাচ্ছন্ন থাকলে ত্রিশ দিন সিয়াম রাখ।\n" +
            "(বুখারী ১৯০৯ মুসলিম ২৫৬৬, শব্দাবলী বুখারীর)\n" +
            "\n" +
            "13.আনাস ইবনে মালিক (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা সেহরী খাও। কেননা, সেহরীতে বরকত নিহিত আছে।\n" +
            "(বুখারী ১৯২৩, মুসলিম ২৬০৩, তিরমিযী, নাসাঈ, ইবনে মাজাহ)\n" +
            "\n" +
            "14.ইবনে উমার (রাঃ) হতে বর্ণিত, তিনি বলেন, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, অবশ্যই আল্লাহ তাদের প্রতি করুণা বর্ষণ করেন, যারা সেহরী খায়, আর ফিরিশতাবর্গও তাদের জন্য দু'আ করে থাকেন।\n" +
            "(ত্বাবারানীর আওসাত্ব ৬৪৩৪, ইবনে হিব্বান ৩৬৬৭, সহীহ তারগীব ১০৫৩)\n" +
            "\n" +
            "15.আনাস (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নামায পড়ার আগে কতিপয় টাটকা পাকা খেজুর দিয়ে ইফতার করতেন। যদি টাটকা পাকা খেজুর না পেতেন, তাহলে শুকনো কয়েকটি খেজুর যোগে ইফতার করতেন। যদি শুকনো খেজুরও না হত, তাহলে কয়েক ঢোক পানি পান করতেন।\n" +
            "(আবূ দাঊদ ২৩৫৮, তিরমিযী ৬৯৬)\n" +
            "\n" +
            "16.যায়েদ ইবনে খালেদ জুহানী (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি কোন সিয়াম পালনকারী-কে ইফতার করাবে, সে (রোযাদারের) সমান নেকীর অধিকারী হবে। আর তাতে রোযাদারের নেকীর কিছুই কমবে না।\n" +
            "(তিরমিযী ৮০৭, নাসাঈর কুবরা ৩৩৩১-৩৩৩২, ইবনে মাজাহ ১৭৪৬, ইবনে হিব্বান ৩৪২৯, সহীহ তারগীব ১০৬৫ নং)\n" +
            "\n" +
            "17.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি ঈমানের সাথে ও নেকীর আশায় রমযান মাসে কিয়াম করবে (তারাবীহ পড়বে), তার পূর্বেকার পাপসমূহ মাফ করে দেওয়া হবে।\n" +
            "(বুখারী ৩৭, ২০০৮-২০০৯, মুসলিম ১৮১৫, আবু দাঊদ, তিরমিযী, নাসাঈ)\n" +
            "\n" +
            "18.আয়েশা (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযান-অরমযান সকল সময়ে ১১ রাকআতের বেশী (রাতের) নামায পড়তেন না।\n" +
            "(বুখারী ১১৪৭, ২০১৩, ৩৫৬৯, মুসলিম ১৭৫৭)\n" +
            "\n" +
            "19.আব্দুল্লাহ ইবনে উমার (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযানের শেষ দশকে ই'তিকাফ করতেন।\n" +
            "(বুখারী ২০২৫, মুসলিম ২৮৩৮)\n" +
            "\n" +
            "20.আবূ হুরাইরা (রাঃ) বলেন, একদা আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে বসে ছিলাম। এমন সময় তাঁর নিকট এক ব্যক্তি উপস্থিত হয়ে বলল, হে আল্লাহর রসূল! আমি ধ্বংসগ্রস্ত হয়ে পড়েছি। তিনি বললেন, কোন্ জিনিস তোমাকে ধ্বংসগ্রস্ত ক'রে ফেলল? লোকটি বলল, আমি সিয়াম অবস্থায় আমার স্ত্রীর সাথে সঙ্গম ক'রে ফেলেছি। এ কথা শুনে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেন, তুমি কি একটি ক্রীতদাস মুক্ত করতে পারবে? লোকটি বলল, জী না। তিনি বললেন, তাহলে কি তুমি একটানা দুই মাস সিয়াম রাখতে পারবে? সে বলল, জী না। তিনি বললেন, তাহলে কি তুমি ষাট জন মিসকীনকে খাদ্যদান করতে পারবে? লোকটি বলল, জী  না।\n" +
            "\n" +
            "কিছুক্ষণ পর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এক ঝুড়ি খেজুর এনে বললেন, এগুলি নিয়ে দান করে দাও। লোকটি বলল, আমার চেয়ে বেশী গরীব মানুষকে হে আল্লাহর রসূল? আল্লাহর কসম! (মদীনার) দুই হার্রার মাঝে আমার পরিবার থেকে বেশী গরীব অন্য কোন পরিবার নেই! এ কথা শুনে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হেসে ফেললেন এবং তাতে তাঁর ছেদক দাঁত দেখা গেল। অতঃপর বললেন, তোমার পরিবারকেই তা খেতে দাও!\n" +
            "(বুখারী ১৯৩৬-১৯৩৭, মুসলিম ২৬৫১)\n" +
            "\n" +
            "21.আয়েশা (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযানের শেষ দশকে মহান আল্লাহ তাঁকে মৃত্যুদান করা পর্যন্ত ই'তিকাফ করেছেন। তাঁর (তিরোধানের) পর তাঁর স্ত্রীগণ ই'তিকাফ করেছেন।\n" +
            "(বুখারী ২০২৬, মুসলিম ২৮৪১)\n" +
            "\n" +
            "22.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি ঈমান ও বিশ্বাসের সাথে এবং সওয়াবের আশা রেখে রমযানের সিয়াম রাখে, তার পূর্বেকার পাপরাশি মাফ হয়ে যায়। আর যে ব্যক্তি শবেক্বদরে (ভাগ্যরজনী অথবা মহিয়সী রজনীতে) ঈমানসহ নেকীর আশায় কিয়াম করে (নামায পড়ে), তার অতীতের গুনাহ মাফ করে দেওয়া হয়।\n" +
            "(বুখারী ৩৫, ১৯০১, ২০১৪, মুসলিম ১৮১৭)\n" +
            "\n" +
            "23.আয়েশা (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযানের শেষ দশ দিনে এতেকাফ করতেন এবং বলতেন, তোমরা রমযানের শেষ দশকে শবেক্বদর অনুসন্ধান কর।\n" +
            "(বুখারী ২০২০, মুসলিম ২৮৩৩)\n" +
            "\n" +
            "24.আয়েশা (রাঃ)  হতে বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, রমযান মাসের শেষ দশকের বিজোড় (রাত)গুলিতে শবেক্বদর অনুসন্ধান কর।\n" +
            "(বুখারী ২০১৭)\n" +
            "\n" +
            "25.আয়েশা (রাঃ) হতে আরো বর্ণিত, তিনি বলেন, যখন রমযানের শেষ দশক প্রবেশ করত, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাতে নিজে জাগতেন, নিজ পরিজনদেরকেও জাগাতেন, কঠোর পরিশ্রম করতেন এবং কোমরে লুঙ্গি বেঁধে নিতেন।\n" +
            "(বুখারী ২০২৪, মুসলিম ২৮৪৪)\n" +
            "\n" +
            "26.আয়েশা (রাঃ) হতেই বর্ণিত, তিনি বলেন, একদা আমি নিবেদন করলাম, হে আল্লাহর রসূল! আপনি বলুন, যদি আমি (ভাগ্যক্রমে) শবেক্বদর জেনে নিই, তাহলে তাতে কোন্ (দু'আ) পড়ব? তিনি বললেন, এই দু'আ, আল্লাহুম্মা ইন্নাকা আফুউবুন (কারীমুন) তুহিব্বুল আফওয়া ফা'ফু আন্নী। অর্থাৎ, হে আল্লাহ! নিশ্চয় তুমি ক্ষমাশীল, (মহানুভব) ক্ষমা ভালবাস। সুতরাং তুমি আমাকে ক্ষমা করে দাও।\n" +
            "(আহমহদ ২৫৩৮৪, তিরমিযী ৩৫১৩, নাসাঈর কুবরা ৭৭১২, ইবনে মাজাহ ৩৮৫০, হাকেম ১৯৪২)\n" +
            "\n" +
            "27.আয়েশা (রাঃ) কর্তৃক বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি সিয়াম বাকী রেখে মারা যায়, তার পক্ষ থেকে তার অভিভাবক সিয়াম রেখে দেবে।\n" +
            "(বুখারী ১৯৫২, মুসলিম ২৭৪৮)";

    String hadith_iman = "1.মুআয বিন জাবাল (রাঃ) বলেন, একদা আমি উফাইর নামক এক গাধার পিঠে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিছনে সওয়ার ছিলাম। তিনি বললেন, \"হে মুআয! তুমি কি জান, বান্দার উপর আল্লাহর অধিকার এবং আল্লাহর উপর বান্দার অধিকার কি?\" আমি বললাম, আল্লাহ ও তাঁর রসূল অধিক জানেন। তিনি বললেন, \"বান্দার উপর আল্লাহর অধিকার হল এই যে, বান্দা একমাত্র তাঁরই ইবাদত করবে এবং তাঁর সাথে কোন কিছুকে শরীক করবে না। আর আল্লাহর উপর বান্দার অধিকার হল এই যে, তাঁর সাথে যে কোন কিছুকে শরীক করে না তাকে আযাব না দেওয়া।\"\n" +
            "(বুখারী হা. ২৮৫৬, মুসলিম হা. ১৫৩)\n" +
            "\n" +
            "2.উসমান (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যে ব্যক্তি 'আল্লাহ ছাড়া কেউ সত্য উপাস্য নেই' এ কথা জানা অবস্থায় মারা যাবে, সে জান্নাত প্রবেশ করবে।'\n" +
            "(মুসলিম ১৪৫, আহমাদ ৪৬৪)\n" +
            "\n" +
            "3.মুআয বিন জাবাল (রাঃ) কর্তৃক বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যার শেষ কথা 'লা- ইলাহা ইল্লাল্লাহ' হবে, সে জান্নাতে প্রবেশ করবে।\n" +
            "(আহমাদ ২২০৩৪, ২২১২৭, আবূ দাঊদ ৩১১৮, হাকেম ১২৯৯, সহীহুল জামে' ৬৪৭৯)\n" +
            "\n" +
            "4.মুআয (রাঃ) কর্তৃক বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যে ব্যক্তি সত্য-চিত্তে (ইখলাসের সাথে) 'আশহাদু আল্লা ইলা-হা ইল্লাল্লাহু, অআন্না মুহাম্মাদার রাসূলুল্লাহ' বলবে, সে জান্নাতে প্রবেশ করবে।\n" +
            "(আহমাদ ২২০০৩, বাইহাক্বীর শুআবুল ঈমান ৭, সিঃ সহীহাহ ২২৭৮)\n" +
            "\n" +
            "5.মুসাইয়িব কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিতৃব্য আবু তালেবের যখন মরণকাল উপস্থিত হয়, তখন তিনি তাঁকে বলেছিলেন, 'হে পিতৃব্য! আপনি 'লা- ইলাহা ইল্লাল্লাহ' বলুন -এটা এমন এক কালিমা যাকে আল্লাহর নিকট আপনার (মুক্তির) জন্য দলীল স্বরূপ পেশ করব।\n" +
            "(বুখারী ৩৮৮৪, ৪৭৭২, ৬৬৮১)\n" +
            "\n" +
            "6.আবূ মালিক তাঁর পিতা থেকে বর্ণনা করে বলেন, আমি শুনেছি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি 'লা- ইলাহা ইল্লাল্লাহ' (আল্লাহ ছাড়া কোন সত্য উপাস্য নেই) বলবে এবং আল্লাহ ব্যতীত পূজ্যমান যাবতীয় ব্যক্তি ও বস্তুকে অস্বীকার ও অমান্য করবে, তার জান ও মাল অবৈধ হয়ে যাবে। (অর্থাৎ সে ইসলামী রাষ্ট্রে নিরাপত্তা লাভ করবে।) আর তার হিসাব আল্লাহর উপর।\n" +
            "(মুসলিম ১৩৯)\n" +
            "\n" +
            "7.আনাস বিন মালিক (রাঃ) কর্তৃক বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, (পরকালে) আল্লাহ বলবেন, সেই ব্যক্তিকে জাহান্নাম থেকে বের কর, যে 'লা- ইলাহা ইল্লাল্লাহ' বলেছে এবং তার হৃদয়ে যবের দানা পরিমাণ মঙ্গল (ঈমান) আছে। সেই ব্যক্তিকেও জাহান্নাম থেকে বের কর, যে 'লা- ইলাহা ইল্লাল্লাহ' বলেছে এবং তার হৃদয়ে অণু (বা ভুট্টা) পরিমাণ মঙ্গল (ঈমান) আছে। আর সেই ব্যক্তিকেও জাহান্নাম থেকে বের কর, যে 'লা- ইলাহা ইল্লাল্লাহ' বলেছে এবং তার হৃদয়ে গমের দানা পরিমাণ মঙ্গল (ঈমান) আছে।\n" +
            "(আহমাদ ৩/২৭৬, তিরমিযী ২৫৯৩, এ হাদীসের মূল রয়েছে সহীহায়নে)\n" +
            "\n" +
            "8.আব্দুল্লাহ বিন আমর বিন আস (রাঃ) কর্তৃক বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, (কিয়ামতের দিন) আল্লাহ আমার উম্মতের একটি লোককে বেছে নিয়ে তার সামনে নিরানব্বইটি (আমল-নামা) রেজিষ্টার বিছিয়ে দেবেন; প্রত্যেকটি রেজিষ্টার দৃষ্টি বরাবর লম্বা! অতঃপর তাকে জিজ্ঞাসা করবেন, 'তুমি কি লিখিত পাপের কোন কিছু অস্বীকার কর? আমার আমল সংরক্ষক ফিরিশতা কি তোমার প্রতি কোন অন্যায় করেছে?' লোকটি বলবে, 'না, হে আমার প্রতিপালক!' আল্লাহ বলবেন, তোমার কি কোন পেশ করার মত ওযর আছে অথবা তোমার কি কোন নেকী আছে?' লোকটি হতবাক হয়ে বলবে, 'না, হে আমার প্রতিপালক!' আল্লাহ বলবেন, 'অবশ্যই আমাদের কাছে তোমার একটি নেকী আছে। আর আজ তোমার প্রতি কোন প্রকার অবিচার করা হবে না।'\n" +
            "অতঃপর একটি কার্ড বের করা হবে, যাতে লেখা থাকবে, 'আশহাদু আল লা- ইলাহা ইল্লাল্লাহ অআন্না মুহাম্মাদান আবদুহু অরসূলুহ।' আল্লাহ মীযান (দাঁড়িপাল্লা) আনতে আদেশ করবেন। লোকটি বলবে, 'হে আমার প্রতিপালক! এতগুলি বড় বড় রেজিষ্টারের কাছে এই কার্ডটির ওজন আর কী হবে?' আল্লাহ বলবেন, 'তোমার প্রতি অবিচার করা হবে না।' অতঃপর রেজিষ্টারগুলোকে দাঁড়ির এক পাল্লায় এবং ঐ কার্ডটিকে অন্য পাল্লায় চড়ানো হবে। দেখা যাবে, রেজিষ্টারগুলোর ওজন হাল্কা এবং কার্ডটির ওজন ভারী হয়ে গেছে! যেহেতু আল্লাহর নামের চেয়ে অন্য কিছু ভারী নয়।\n" +
            "(আহমাদ ৬৯৯৪, তিরমিযী ২৬৩৯, ইবনে মাজাহ ৪৩০০, হাকেম১/৪৬)\n" +
            "\n" +
            "9.আব্দুল্লাহ বিন আমর (রাঃ) কর্তৃক বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ''নূহ (আঃ) মৃত্যুর সময় তাঁর দুই ছেলেকে অসিয়ত করে বললেন, ...আমি তোমাকে 'লা- ইলাহা ইল্লাল্লাহ' (বলার) আদেশ করছি। যেহেতু যদি সাত আসমান এবং সাত যমীনকে দাঁড়িপাল্লার এক পাল্লায় রাখা হয় এবং 'লা- ইলাহা ইল্লাল্লাহ'কে অপর পাল্লায় রাখা হয়, তাহলে 'লা- ইলাহা ইল্লাল্লাহ'র পাল্লা বেশী ভারী হবে। যদি সাত আসমান এবং সাত যমীন নিরেট গোলাকার বস্তু হয়, তাহলেও 'লা- ইলাহা ইল্লাল্লাহ' তা চূর্ণবিচূর্ণ করে দেবে।\n" +
            "(আহমাদ ৭১০১, ত্বাবরানী, বায্যার, মাজমাউয যাওয়াইদ ৪/২১৯, সিঃ সহীহাহ ১৩৪)\n" +
            "\n" +
            "10.জাবের (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যে ব্যক্তি কোন কিছুকে আল্লাহর শরীক (শির্ক) না করে মারা যাবে, সে ব্যক্তি জান্নাতে প্রবেশ করবে। আর যে ব্যক্তি কোন কিছুকে আল্লাহর শরীক (শির্ক) করে মারা যাবে, সে ব্যক্তি জাহান্নামে প্রবেশ করবে।\n" +
            "(মুসলিম ২৭৯)\n" +
            "\n" +
            "11.আবূ হুরাইরাহ (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, সাতটি সর্বনাশী কর্ম হতে দূরে থাক। সকলে বলল, 'হে আল্লাহর রসূল! তা কী কী?' তিনি বললেন, ''আল্লাহর সাথে  শির্ক করা, যাদু করা, ন্যায় সঙ্গত অধিকার ছাড়া আল্লাহ যে প্রাণ হত্যা করা হারাম করেছেন তা হত্যা করা, সূদ খাওয়া, এতীমের মাল ভক্ষণ করা, (যুদ্ধক্ষেত্র হতে) যুদ্ধের দিন পলায়ন করা এবং সতী উদাসীনা মুমিনা নারীর চরিত্রে মিথ্যা অপবাদ দেওয়া।\n" +
            "(বুখারী ২৭৬৬, ৬৮৫৭, মুসলিম ২৭২, আবূ দাউদ, নাসাঈ)\n" +
            "\n" +
            "12.আবূ হুরাইরা (রাঃ) কর্তৃক বর্ণিত, \"তোমার নিকটতম স্বজনবর্গকে তুমি সতর্ক ক'রে দাও\"। (শুআ'রাঃ ২১৪) এই আয়াত যখন অবতীর্ণ হল, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর আত্মীয় ও বংশকে সম্বোধন করে বললেন, হে কুরাইশদল! তোমরা আল্লাহর নিকট নিজেদেরকে বাঁচিয়ে নাও, আমি তোমাদের ব্যাপারে আল্লাহর নিকট কোন উপকার করতে পারব না। হে বানী আব্দুল মুত্তালিব! আমি আল্লাহর দরবারে তোমাদের কোন উপকার করতে পারব না। হে (চাচা) আব্বাস বিন আব্দুল মুত্তালিব! আমি আল্লাহর দরবারে আপনার কোন কাজে আসব না। হে আল্লাহর রসূলের ফুফু সাফিয়্যাহ! আমি আপনার জন্য আল্লাহর দরবারে কোন উপকারে আসব না। হে আল্লাহর রসূলের বেটী ফাতেমা! আমার কাছে যে ধন-সম্পদ চাইবে চেয়ে নাও, আমি আল্লাহর কাছে তোমার কোন উপকার করতে পারব না।\n" +
            "(বুখারী ৩৫২৭, মুসলিম ৫২২, ৫২৫)\n" +
            "\n" +
            "12.আবূ হুরাইরা (রাঃ) কর্তৃক বর্ণিত, \"তোমার নিকটতম স্বজনবর্গকে তুমি সতর্ক ক'রে দাও\"। (শুআ'রাঃ ২১৪) এই আয়াত যখন অবতীর্ণ হল, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর আত্মীয় ও বংশকে সম্বোধন করে বললেন, হে কুরাইশদল! তোমরা আল্লাহর নিকট নিজেদেরকে বাঁচিয়ে নাও, আমি তোমাদের ব্যাপারে আল্লাহর নিকট কোন উপকার করতে পারব না। হে বানী আব্দুল মুত্তালিব! আমি আল্লাহর দরবারে তোমাদের কোন উপকার করতে পারব না। হে (চাচা) আব্বাস বিন আব্দুল মুত্তালিব! আমি আল্লাহর দরবারে আপনার কোন কাজে আসব না। হে আল্লাহর রসূলের ফুফু সাফিয়্যাহ! আমি আপনার জন্য আল্লাহর দরবারে কোন উপকারে আসব না। হে আল্লাহর রসূলের বেটী ফাতেমা! আমার কাছে যে ধন-সম্পদ চাইবে চেয়ে নাও, আমি আল্লাহর কাছে তোমার কোন উপকার করতে পারব না।\n" +
            "(বুখারী ৩৫২৭, মুসলিম ৫২২, ৫২৫)\n" +
            "\n" +
            "13.ইবনে আব্বাস (রাঃ) কর্তৃক বর্ণিত, একদা এক ব্যক্তি কোন ব্যাপারে তাঁকে বলল, 'আল্লাহ ও আপনি যা চেয়েছেন (তাই হয়েছে)।' তা শুনে তিনি বললেন, তুমি তো আল্লাহর সঙ্গে আমাকে শরীক (বা সমকক্ষ) করে ফেললে! না; বরং আল্লাহ একাই যা চেয়েছেন, তাই হয়েছে।\n" +
            "(আহমাদ ১৮৩৯, বুখারীর আদব ৭৮৩, ইবনে মাজাহ ২১১৭, বাইহাক্বী ৫৬০৩, সিঃ সহীহাহ ১৩৯)\n" +
            "\n" +
            "14.উবাদাহ বিন স্বামেত (রাঃ) কর্তৃক বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মরণের পূর্বে কখনই তোমরা তোমাদের প্রতিপালককে দেখতে পাবে না।\n" +
            "(আহমাদ ২২৭৬৪, নাসাঈর কুবরা ৭৭৬৪, সহীহুল জামে' ২৪৫৯)\n" +
            "\n" +
            "15.উমার (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা আমাকে নিয়ে (আমার তা'যীমে) বাড়াবাড়ি করো না, যেমন খ্রিষ্টানরা ঈসা ইবনে মারয়্যামকে নিয়ে করেছে। আমি তো আল্লাহর দাস মাত্র। অতএব তোমরা আমাকে আল্লাহর দাস ও তাঁর রসূলই বলো।\n" +
            "(বুখারী, ৩৪৪৫, মিশকাত ৪৮৯৭)\n" +
            "\n" +
            "16.আবূ হুরাইরা (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কিয়ামতে লোকেরা সবাই সুপারিশের জন্য আদম, নূহ, ইব্রাহীম, মূসা ও ঈসা নবীর কাছে যাবে। তাঁরা একে একে সকলে ওযর পেশ করলে অবশেষে লোকেরা শেষনবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) এর কাছে এসে বলবে, 'হে মুহাম্মাদ! আপনি আল্লাহর রসূল। আপনি আখেরী নবী। আল্লাহ আপনার পূর্বাপর যাবতীয় গুনাহ মাফ করে দিয়েছেন। অতএব আপনি আমাদের জন্য আপনার প্রতিপালকের কাছে সুপারিশ করুন। আপনি কি দেখছেন না, আমরা কি (ভয়াবহ) দুঃখ ও যন্ত্রণা ভোগ করছি।'\n" +
            "তখন তিনি চলে যাবেন এবং আরশের নীচে তাঁর প্রতিপালকের জন্য সিজদাবনত হবেন। অতঃপর আল্লাহ তাঁর প্রশংসা ও গুণগানের জন্য তাঁর হৃদয়কে এমন উন্মুক্ত করে দেবেন, যেমন ইতিপূর্বে আর কারো জন্য করেননি। অতঃপর আল্লাহ বলবেন, 'হে মুহাম্মাদ! মাথা উঠাও, চাও, তোমাকে দেওয়া হবে। সুপারিশ কর, গ্রহণ করা হবে।' তখন শেষনবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) মাথা উঠিয়ে বলবেন, আমার উম্মতকে (রক্ষা করুন) হে আমার প্রতিপালক! আমার উম্মতকে (রক্ষা করুন) হে প্রতিপালক! আমার উম্মতকে (রক্ষা করুন) হে প্রতিপালক!\u009E\n" +
            "(বুখারী ৩৩৪০, মুসলিম ৫০১)\n" +
            "\n" +
            "17.ইবনে আব্বাস (রাঃ) বলেন, আমি একদা (সওয়ারীর উপর) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পিছনে (বসে) ছিলাম। তিনি বললেন, ওহে কিশোর! আমি তোমাকে কয়েকটি (গুরুত্বপূর্ণ) কথা (শিক্ষা দেব (তুমি সেগুলো স্মরণ রেখো)। তুমি আল্লাহর (বিধানসমূহের) রক্ষণাবেক্ষণ কর (তাহলে) আল্লাহও তোমার রক্ষণাবেক্ষণ করবেন। তুমি আল্লাহর (অধিকারসমূহ) স্মরণ রাখো, তাহলে তুমি তাঁকে তোমার সম্মুখে পাবে। যখন তুমি চাইবে, তখন আল্লাহর কাছেই চাও। আর যখন তুমি সাহায্য প্রার্থনা করবে, তখন একমাত্র আল্লাহর কাছেই সাহায্য প্রার্থনা কর। আর এ কথা জেনে রাখ যে, যদি সমস্ত উম্মত তোমার উপকার করার জন্য একত্রিত হয়ে যায়, তবে ততটুকুই উপকার করতে পারবে, যতটুকু আল্লাহ তোমার (ভাগ্যে) লিখে রেখেছেন। আর তারা যদি তোমার ক্ষতি করার জন্য একত্রিত হয়ে যায়, তবে ততটুকুই ক্ষতি করতে পারবে যতটুকু আল্লাহ তোমার (ভাগ্যে) লিখে রেখেছেন। কলমসমূহ উঠিয়ে নেওয়া হয়েছে এবং খাতাসমূহ (ভাগ্যলিপি) শুকিয়ে গেছে।\n" +
            "(তিরমিযী ২৫১৬)\n" +
            "\n" +
            "18.আনাস বিন মালিক (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কোন উৎকণ্ঠা ও দুশ্চিন্তায় পড়লে বলতেন, ''হে চিরঞ্জীব! হে অবিনশ্বর! আমি তোমার রহমতের অসীলায় (তোমার নিকট) সাহায্যের আবেদন করছি।\n" +
            "(তিরমিযী ৩৫২৪)\n" +
            "\n" +
            "19.আবূ সাঈদ খুদরী (রাঃ) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা আমাকে বিশ্বাস কর না কি? অথচ আমি তাঁর নিকট বিশ্বস্ত যিনি আকাশে আছেন। আমার নিকট সকাল ও সন্ধ্যায় আকাশের খবর আসে।\n" +
            "(বুখারী ৪৩৫১, মুসলিম ২৫০০)\n" +
            "\n" +
            "20.আবূ হুরাইরা (রাঃ) বলেন, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ঈমান সত্তর বা ষাটের অধিক শাখাবিশিষ্ট;  যার উত্তম (ও প্রধান) শাখা 'লা ইলা-হা ইল্লাল্লাহ' (আল্লাহ ছাড়া কোন সত্য উপাস্য নেই) বলা এবং সবচেয়ে ক্ষুদ্র শাখা পথ হতে কষ্টদায়ক বস্ত্ত অপসারণ করা। আর লজ্জাশীলতা ঈমানের অন্যতম শাখা।\n" +
            "(মুসলিম ১৬২)";

    String hadith_hazz = "1.আব্দুল্লাহ ইবনে উমার (রাঃ) থেকে বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ইসলামের ভিত পাঁচটি জিনিসের উপর স্থাপিত আছে। (১) এই সাক্ষ্য দেওয়া যে, আল্লাহ ছাড়া কোন সত্য মা'বূদ (উপাস্য) নেই এবং মুহাম্মাদ আল্লাহর প্রেরিত মহাপুরুষ, (২) নামায কায়েম করা, (৩) যাকাত  প্রদান করা, (৪) বায়তুল্লাহর হজ্জ করা এবং (৫) মাহে রমযানের সিয়াম (সিয়াম) পালন করা।\n" +
            "(বুখারী ৮, মুসলিম ১২২)\n" +
            "\n" +
            "2.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের সামনে ভাষণ দানকালে বললেন, হে লোক সকল! আল্লাহ তোমাদের উপর (বায়তুল্লাহর) হজ্জ ফরয করেছেন, অতএব তোমরা হজ্জ পালন কর। একটি লোক বলে উঠল, হে আল্লাহর রসূল! প্রতি বছর তা করতে হবে কি? তিনি নিরুত্তর থাকলেন এবং লোকটি শেষ পর্যন্ত তিনবার জিজ্ঞাসা করল। অতঃপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যদি আমি বলতাম, হ্যাঁ। তাহলে (প্রতি বছরে) হজ্জ ফরয হয়ে যেত। আর তোমরা তা পালন করতে অক্ষম হতে।\n" +
            "অতঃপর তিনি বললেন, তোমরা আমাকে (আমার অবস্থায়) ছেড়ে দাও, যতক্ষণ আমি তোমাদেরকে (তোমাদের স্ব-স্ব অবস্থায়) ছেড়ে রাখব। কেননা, তোমাদের পূর্বেকার জাতিরা অতি মাত্রায় জিজ্ঞাসাবাদ ও তাদের পয়গম্বরদের বিরোধিতা করার দরুন ধ্বংস হয়েছে। সুতরাং আমি যখন তোমাদেরকে কোন কিছু করার আদেশ দেব, তখন তোমরা তা সাধ্যমত পালন করবে। আর যা করতে নিষেধ করব, তা থেকে বিরত থাকবে।\n" +
            "(মুসলিম ৩৩২১)\n" +
            "\n" +
            "3.আবূ হুরাইরা (রাঃ) থেকেই বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে জিজ্ঞাসা করা হল, সর্বোত্তম কাজ কী? তিনি বললেন, আল্লাহ ও তার রসূলের প্রতি ঈমান রাখা। জিজ্ঞাসা করা হল, তারপর কী? তিনি বললেন, আল্লাহর পথে জিহাদ করা। পুনরায় তাঁকে জিজ্ঞাসা করা হল, অতঃপর কী? তিনি বললেন, মাবরূর (বিশুদ্ধ বা গৃহীত) হজ্জ।\n" +
            "'মাবরূর' (বিশুদ্ধ বা গৃহীত) হজ্জ সেই হজ্জকে বলা হয়, যাতে হাজী কোন প্রকার আল্লাহর অবাধ্যতা ও পাপাচারে লিপ্ত হয়নি।\n" +
            "\n" +
            "4.আবূ হুরাইরা (রাঃ) থেকেই বর্ণিত, তিনি বলেন, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে এ কথা বলতে শুনেছি যে, যে ব্যক্তি (আল্লাহর জন্য) হজ্জ পালন করল এবং (তাতে) কোন অশ্লীল কাজ করল না ও পাপাচার করল না, সে ব্যক্তি ঠিক ঐ দিনকার মত (নিষ্পাপ হয়ে) বাড়ি ফিরবে, যেদিন তার মা তাকে প্রসব করেছিল।\n" +
            "(বুখারী ১৫২১, ১৮১৯-১৮২০, মুসলিম ৩৩৫৭-৩৩৫৮)\n" +
            "\n" +
            "5.আবূ হুরাইরা (রাঃ) থেকেই বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, একটি উমরাহ পরবর্তী উমরাহ পর্যন্ত ঐ দুয়ের মধ্যবর্তী সময়ে কৃত পাপরাশির জন্য কাফফারা (মোচনকারী) হয়। আর 'মাবরূর' (বিশুদ্ধ বা গৃহীত) হজ্জের প্রতিদান জান্নাত ছাড়া আর কিছুই নয়।\n" +
            "(বুখারী ১৭৭৩, মুসলিম ৩৩৫৫)\n" +
            "\n" +
            "6.ইবনে উমার (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, পবিত্র কা'বার দিকে স্বগৃহ থেকে তোমার বের হওয়াতে, তোমার সওয়ারীর প্রত্যেক পদক্ষেপের বিনিময়ে আল্লাহ একটি করে সওয়াব লিপিবদ্ধ করবেন এবং একটি করে পাপ মোচন করবেন। আরাফায় অবস্থান কালে আল্লাহ নিচের আসমানে নেমে আসেন এবং তাদেরকে (হাজীদেরকে) নিয়ে ফিরিশতাবর্গের নিকট গর্ব করেন। বলেন, 'আমার ঐ বান্দাগণ আলুথালু কেশে ধূলামলিন বেশে দূর-দূরান্তর পথ অতিক্রম করে আমার কাছে এসে আমার রহমতের আশা করে এবং আমার আযাবকে ভয় করে, অথচ তারা আমাকে দেখেনি। তাহলে তারা আমাকে দেখলে কি করত?\n" +
            "সুতরাং তোমার যদি বালির পাহাড় অথবা পৃথিবীর বয়স অথবা আকাশের বৃষ্টি পরিমাণ গোনাহ থাকে, আল্লাহ তা ধৌত করে দেবেন। পাথর মারার সওয়াব তোমার জন্য জমা থাকবে। মাথা নেড়া করলে প্রত্যেক চুলের বিনিময়ে একটি করে সওয়াব লিখা হবে। অতঃপর কা'বাগৃহের তওয়াফ করলে তুমি তোমার পাপরাশি থেকে সেই দিনের মত বের হবে, যেদিন তোমার মা তোমাকে জন্ম দিয়েছিল।\n" +
            "(ত্বাবারানী ১৩৩৯০, সহীহুল জামে' ১৩৬০)\n" +
            "\n" +
            "7.ইবনে আব্বাস (রাঃ) হতে বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, তোমরা হজ্জকে উমরাহ ও উমরাহকে হজ্জের অনুগামী কর। (অর্থাৎ হজ্জ করলে উমরাহ ও উমরাহ করলে হজ্জ কর।) কারণ, হজ্জ ও উমরাহ উভয়েই দারিদ্র ও পাপরাশিকে সেইরূপ দূরীভূত করে যেরূপ (কামারের) হাপর লোহার ময়লাকে দূরীভূত করে ফেলে।\n" +
            "(নাসাঈ ২৬৩০-২৬৩১, তিরমিযী, নাসাঈ প্রমুখ অন্য সাহাবী হতে, ত্বাবারানী ১১০৩৩)\n" +
            "\n" +
            "8.আবূ সাঈদ খুদরী (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহ আযযা অজাল্ল বলেন, যে বান্দাকে আমি দৈহিক সুস্থতা দিয়েছি এবং আর্থিক প্রাচুর্য দান করেছি, অতঃপর তার পাঁচ বছর অতিবাহিত হয়ে যায় অথচ আমার দিকে (হজ্জব্রত পালন করতে) আগমন করে না, সে অবশ্যই বঞ্চিত।\n" +
            "(ইবনে হিব্বান ৩৭০৩, বাইহাকী ১০৬৯৫, আবূ য়্যা'লা ১০৩১, সিলসিলাহ সহীহাহ ১৬৬২)\n" +
            "\n" +
            "9.আবূ হুরাইরা (রাঃ) কর্তৃক বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, হজ্জ ও উমরাহকারিগণ আল্লাহর বিশেষ প্রতিনিধিদল (অতিথি)। তারা আল্লাহকে আহবান করলে তিনি সাড়া দিয়ে থাকেন। আর তারা তাঁর নিকট ক্ষমা চাইলে তিনি তাদেরকে ক্ষমা করে থাকেন।\n" +
            "(ইবনে মাজাহ ২৮৯২, সহীহ তারগীব ১১০৯)\n" +
            "\n" +
            "10.ইবনে উমার (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আল্লাহর পথে মুজাহিদ, হজ্জ ও উমরাহকারিগণ আল্লাহর বিশেষ প্রতিনিধিদল (অতিথি)। আল্লাহ তাদেরকে (জিহাদ ও কা'বা শরীফ যিয়ারতের জন্য) আহবান করলে তারা সারা দিয়ে (উপস্থিত হয়ে) থাকে। আর তারা তাঁর নিকট চাইলে তিনি তাদেরকে দান করে থাকেন।\n" +
            "(ইবনে মাজাহ ২৮৯৩)\n" +
            "\n" +
            "11.জাবের (রাঃ) কর্তৃক বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, হজ্জ ও উমরাহকারিগণ আল্লাহর বিশেষ প্রতিনিধিদল (অতিথি)। আল্লাহ তাদেরকে (কা'বা শরীফ যিয়ারতের জন্য) আহবান করলে তারা সারা দিয়ে (উপস্থিত হয়ে) থাকে। আর তারা তাঁর নিকট চাইলে তিনি তাদেরকে দান করে থাকেন।\n" +
            "(বাযযার, সিলসিলাহ সহীহাহ ১৮২০, সহীহুল জামে ৩১৭৩)\n" +
            "\n" +
            "12.আয়েশা (রাঃ) হতে বর্ণিত, তিনি বলেন, একদা আমি বললাম, হে আল্লাহর রসূল! আমরা আল্লাহর পথে জিহাদ করাকে সর্বোত্তম কাজ মনে করি, তাহলে কি আমরা জিহাদ করব না? তিনি বললেন, কিন্তু (মহিলাদের জন্য) সর্বোত্তম জিহাদ হচ্ছে 'মাবরূর' (বিশুদ্ধ বা গৃহীত) হজ্জ।\n" +
            "(বুখারী ১৫২০, ১৮৬১)\n" +
            "\n" +
            "13.আয়েশা (রাঃ) হতে বর্ণিত,থেকেই বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আরাফার দিন অপেক্ষা এমন কোন দিন নেই, যেদিন আল্লাহ সর্বাধিক বেশী সংখ্যায় বান্দাকে দোযখমুক্ত করেন।\n" +
            "(মুসলিম ৩৩৫৪)\n" +
            "\n" +
            "14.ইবনে আব্বাস (রাঃ) থেকে বর্ণিত, একজন মহিলা বলল, হে আল্লাহর রসূল! আল্লাহর স্বীয় বান্দাদের উপর হজ্জের ফরয আমার বৃদ্ধ পিতার উপর এমতাবস্থায় এসে পৌঁছেছে যে, তিনি বাহনের উপর চড়ে বসে থাকতে অক্ষম। আমি কি তার পক্ষ হতে হজ্জ পালন করব? তিনি বললেন, হ্যাঁ।\n" +
            "(বুখারী ১৫১৩, মুসলিম ৩৩১৫)\n" +
            "\n" +
            "15.ইবনে আব্বাস (রাঃ) কর্তৃক বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা (ফরয) হজ্জ পালনে ত্বরা কর। যেহেতু তোমাদের কেউ জানে না যে, তার সম্মুখে কোন্ অসুবিধা এসে উপস্থিত হবে।\n" +
            "(আহমাদ ১/৩১৪, ২৮৬৭, ইরওয়া ৪/১৬৮, সহীহুল জামে' ২৯৫৭)\n" +
            "\n" +
            "16.সায়েব ইবনে য়্যাযীদ (রাঃ) হতে বর্ণিত, তিনি বলেন, বিদায় হজ্জে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে আমাকে নিয়ে হজ্জ করা হয়েছে। আমি তখন সাত বছরের শিশু।\n" +
            "(বুখারী ১৮৫৮, তিরমিযী ৯২৫)\n" +
            "\n" +
            "17.ইবনে আব্বাস (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম 'রাওহা' নামক স্থানে একটি যাত্রীদলের সাথে সাক্ষাৎকালে বললেন, তোমরা কোন্ জাতি? তারা বলল, আমরা মুসলমান। তারা বলল, আপনি কে? তিনি বললেন, আমি আল্লাহর রসূল। এই সময়ে একজন মহিলা একটি শিশুকে তুলে ধরে বলল, এর কি হজ্জ হবে? তিনি বললেন, হ্যাঁ। আর (ওকে হজ্জ করানো বাবত) তোমারও সওয়াব হবে।\n" +
            "(মুসলিম ৩৩১৭-৩৩১৯, তিরমিযী ৯২৪)\n" +
            "\n" +
            "18.ইবনে আব্বাস (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মাহে রমযানের উমরাহ একটি হজ্জের সমতুল্য অথবা আমার সঙ্গে হজ্জ করার সমতুল্য।(বুখারী ১৭৮২, ১৮৬৩, মুসলিম ৩০৯৭-৩০৯৮)\n" +
            "\n" +
            "19.উম্মে সালামাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যার কাছে এমন কুরবানীর পশু আছে যাকে যবেহ করার ইচ্ছা রাখে, সে যেন যুলহিজ্জার চন্দ্রোদয়ের পর থেকে কুরবানী যবেহ না করা পর্যন্ত নিজ চুল, নখ কিছু অবশ্যই না কাটে। (মুসলিম ৫২৩৬)\n" +
            "অন্য এক বর্ণনায় বলেন, সে যেন তার (মরা বা ফাটা) চর্মাদির কিছুও স্পর্শ না করে। (মুসলিম ৫২৩২)\n" +
            "\n" +
            "20.আয়েশা (রাঃ) হজ্জ সফরে রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে ছিলেন। রাস্তায় তাঁর ঋতু শুরু হয়ে যায়। তিনি বলেন, আমি কাঁদতে লাগি। সেই সময় নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকটে এলেন। বললেন, কাঁদছ কেন? আমি বললাম, আল্লাহর কসম! যদি এ বছরে হজ্জে বের না হতাম (তাহলে ভাল হত)! তিনি বললেন, সম্ভবতঃ তোমার মাসিক শুরু হয়েছে? আমি বললাম, জী হ্যাঁ। তিনি বললেন, এটি তো এমন জিনিস যা আদম কন্যাদের উপর আল্লাহ অনিবার্য করেছেন। সুতরাং তুমি হাজী যা করে তাই কর, তবে পবিত্র না হওয়া পর্যন্ত তওয়াফ করো না। \n" +
            "(বুখারী ২৯৪, ৩০৫, মুসলিম ২৯৭৭)";

    String hadith_jakat = "1.ইবনে উমার (রাঃ) হতে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, পাঁচটি ভিত্তির উপর দ্বীনে ইসলাম স্থাপিত। (১) এই সাক্ষ্য দেওয়া যে, আল্লাহ ব্যতীত অন্য কোন সত্য উপাস্য নেই এবং মুহাম্মাদ তাঁর বান্দা ও রসূল। (২) নামায প্রতিষ্ঠা করা। (৩) যাকাত আদায় করা। (৪) বায়তুল্লাহর (কা'বা গৃহের) হজ্জ করা এবং (৫) রমযানের রোযা পালন করা।\n" +
            "(বুখারী ৮, মুসলিম ১২২)\n" +
            "\n" +
            "2.ত্বালহা ইবনে উবাইদুল্লাহ (রাঃ) হতে বর্ণিত, তিনি বলেন নাজদ (রিয়ায এলাকার) অধিবাসীদের একজন আলুলায়িত কেশী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হল। আমরা তার ভনভন্ শব্দ শুনছিলাম, আর তার কথাও বুঝতে পারছিলাম না। শেষ পর্যন্ত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর কাছে আসল এবং (তখন বুঝলাম,) সে ইসলাম সম্পর্কে প্রশ্ন করছে। (উত্তরে) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, (ইসলাম হল,) দিবা-রাত্রিতে পাঁচ অক্তের নামায (প্রতিষ্ঠা করা)। সে বলল, তা ছাড়া আমার উপর অন্য নামায আছে কি? তিনি বললেন, না, কিন্তু যা কিছু তুমি নফল হিসাবে পড়বে।\n" +
            "রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আবার বললেন, এবং রমযান মাসের রোযা। লোকটি বলল, তা ছাড়া আমার উপর অন্য রোযা আছে কি? তিনি বললেন, না, তবে তুমি যা নফল হিসাবে করবে। বর্ণনাকারী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে যাকাতের কথা বললেন। সে বলল, তাছাড়া আমার উপর অন্য দান আছে কি? তিনি বললেন, না, তবে তুমি যা নফল হিসাবে করবে। তারপর লোকটি পিঠ ফিরিয়ে এ কথা বলতে বলতে যেতে লাগল, আল্লাহর কসম! আমি এর চাইতে বেশী কিছু করব না এবং এর চেয়ে কমও করব না। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, লোকটি সত্য বলে থাকলে পরিত্রাণ পেয়ে গেল।\n" +
            "(বুখারী ৪৬, ২৬৭৮, মুসলিম ১০৯)\n" +
            "\n" +
            "3.ইবনে আব্বাস (রাঃ) হতে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুআয (রাঃ)-কে ইয়ামান পাঠাবার সময়ে (তাঁর উদ্দেশ্যে) বললেন, তাদের (ইয়ামানবাসীদেরকে সর্বপ্রথম) এই সাক্ষ্য দেওয়ার জন্য আহবান জানাবে যে, আল্লাহ ছাড়া কোন সত্য উপাস্য নেই, আর আমি আল্লাহর রসূল। যদি তারা এ কথা মেনে নেয়, তাহলে তাদেরকে জানিয়ে দেবে যে, আল্লাহ তাদের উপর রাতদিনে পাঁচ ওয়াক্তের নামায ফরয করেছেন। অতঃপর যদি তারা এ কথা মেনে নেয়, তাহলে তাদেরকে জানিয়ে দাও যে, আল্লাহ তাদের উপর যাকাত ফরয করেছেন; যা তাদের মধ্যে যারা (নিসাব পরিমাণ) মালের অধিকারী তাদের নিকট থেকে গ্রহণ করা হবে এবং তাদের দরিদ্র ও অভাবী মানুষদের মাঝে তা বন্টন করে দেওয়া হবে।\n" +
            "(বুখারী ১৩৯৫, ১৪৯৬, মুসলিম ১৩০)\n" +
            "\n" +
            "4.ইবনে উমার (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, মানুষের বিরুদ্ধে ততক্ষণ সংগ্রাম করার জন্য আমি আদিষ্ট হয়েছি, যতক্ষণ পর্যন্ত না তারা এই সাক্ষ্য দেবে যে, আল্লাহ ব্যতীত কোন সত্য উপাস্য নেই এবং মুহাম্মাদ আল্লাহর রসূল। আর নামায কায়েম করবে ও (ধনের) যাকাত আদায় করবে। যখন তারা এগুলি বাস্তবায়ন করবে, তখন ইসলামী হক (অর্থদণ্ড ইত্যাদি) ছাড়া তারা নিজেদের জান-মাল আমার নিকট হতে সুরক্ষেত করে নেবে। আর (অন্তরের গভীরে কুফরী বা পাপ লুকানো থাকলে) তাদের হিসাব আল্লাহর যিম্মায়।\n" +
            "(বুখারী ২৫, মুসলিম ১৩৮)\n" +
            "\n" +
            "5. আবূ হুরাইরা (রাঃ) থেকে বর্ণিত, তিনি বলেন, যখন আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইন্তেকাল করলেন এবং আবূ বাকার (রাঃ) খলীফা নিযুক্ত হলেন। আর আরববাসীদের মধ্যে যার কাফের (মুরতাদ্দ) হবার ছিল সে কাফের (মুরতাদ্দ) হয়ে গেল, (এবং যারা সম্পূর্ণ ধর্মত্যাগ করেনি; বরং যাকাত দিতে অস্বীকার করছে মাত্র, তাদের বিরুদ্ধে আবূ বাকর (রাঃ) সশস্ত্র সংগ্রামের সংকল্প প্রকাশ করলেন)।\n" +
            "তখন উমার (রাঃ) বললেন, ঐ (যাকাত দিতে নারাজ) লোকেদের বিরুদ্ধে কেমন করে যুদ্ধ করবেন অথচ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন যে, লোকেরা 'লা-ইলাহা ইল্লাল্লাহ' (অর্থাৎ আল্লাহ ছাড়া কোন সত্য উপাস্য নেই) না বলা পর্যন্ত তাদের বিরুদ্ধে যুদ্ধ করার জন্য আমি আদিষ্ট হয়েছি। অতএব যে ব্যক্তি তা বলবে, সে ইসলামী অধিকার (অর্থদণ্ড ইত্যাদি) ছাড়া তার জান-মাল আমার নিকট থেকে নিরাপদ করে নেবে। আর তার (অন্তরের গভীরে কুফরী বা পাপ লুকানো থাকলে) হিসাব আল্লাহর যিম্মায়?\n" +
            "আবূ বাকর (রাঃ) বললেন, আল্লাহর শপথ! যে ব্যক্তি নামায ও যাকাতের মধ্যে পার্থক্য করবে, তার বিরুদ্ধে আমি লড়াই করব। কারণ, যাকাত মালের উপর আরোপিত হক। আল্লাহর শপথ! আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে যে রশি আদায় করত, তা যদি আমাকে না দেয়, তাহলে তা না দেওয়ার জন্য তাদের বিরুদ্ধে আমি জিহাদ করবই। উমার (রাঃ) বললেন, 'আল্লাহর শপথ! অচিরেই আমি দেখলাম যে, নিঃসন্দেহে আল্লাহ আবূ বাকর (রাঃ) এর হৃদয়কে যুদ্ধের জন্য প্রশস্ত করেছেন। সুতরাং আমি বুঝতে পারলাম যে, তাঁর সিদ্ধান্তই যথার্থ।\n" +
            "(বুখারী ৭২৮৪-৭২৮৫, মুসলিম ১৩৩)\n" +
            "\n" +
            "6.আবূ আইয়ূব (রাঃ) হতে বর্ণিত, একটি লোক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলল, আমাকে এমন একটি আমল বলুন, যা আমাকে জান্নাতে প্রবেশ করাবে। তিনি বললেন, আল্লাহর বন্দেগী করবে, আর তাঁর সাথে কোন কিছুকে অংশীদার স্থির করবে না। নামায কায়েম করবে, যাকাত দেবে এবং আত্মীয়তার বন্ধন অটুট রাখবে।\n" +
            "অন্য বর্ণনার শব্দাবলীতে আছে, একদা এক ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলল, আমাকে এমন এক আমলের সন্ধান দিন যা আমাকে জান্নাতে প্রবেশ করাবে এবং জাহান্নাম থেকে দূরে রাখবে। সকলে বলল, আরে! কী হল, ওর কী হল? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, ওর কোন প্রয়োজন আছে। (অতঃপর ঐ লোকটির উদ্দেশ্যে বললেন,) তুমি আল্লাহর ইবাদত করবে আর তাঁর সাথে কাউকেও শরীক করবে না। নামায কায়েম করবে, যাকাত প্রদান করবে। আর  আত্মীয়তার বন্ধন অটুট রাখবে।\n" +
            "(বুখারী ১৩৯৬, ৫৯৮৩, মুসলিম ১১৩)\n" +
            "\n" +
            "7.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, এক বেদুঈন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এসে নিবেদন করল, হে আল্লাহর রসূল! আমাকে এমন এক আমলের কথা বলে দিন, যার উপর আমল করলে, আমি জান্নাতে প্রবেশ করতে পারব। তিনি বললেন, আল্লাহর ইবাদত করবে ও তাঁর সাথে কোন কিছুকে অংশীদার স্থির করবে না। নামায কায়েম করবে, ফরয যাকাত আদায় করবে ও রমযানের রোযা পালন করবে। সে বলল, সেই মহান সত্তার শপথ! যাঁর হাতে আমার জীবন আছে, আমি এর চেয়ে বেশী করব না। তারপর যখন সে লোকটা পিঠ ফিরে চলতে লাগল, তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যে ব্যক্তি জান্নাতবাসীদের কোন লোক দেখতে আগ্রহী, সে যেন এই লোকটিকে দেখে।\n" +
            "(বুখারী ১২৯৭, মুসলিম ১১৬)\n" +
            "\n" +
            "8.জারীর ইবনে আব্দুল্লাহ (রাঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাতে নামায কায়েম করার, যাকাত আদায় করার ও প্রতিটি মুসলমানের মঙ্গল কামনা করার বায়আত করেছি।\n" +
            "(বুখারী ৫৭, ৫২৪, মুসলিম ২০৮)\n" +
            "\n" +
            "9.জাবের (রাঃ) হতে বর্ণিত, এক ব্যক্তি বলল, হে আল্লাহর রসূল! এ ব্যাপারে আপনার অভিমত কী; যদি কোন ব্যক্তি তার মালের যাকাত আদায় করে দেয়? উত্তরে আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যে ব্যক্তি তার মালের যাকাত আদায় করে দেয়, সে ব্যক্তির নিকট থেকে তার অনিষ্ট দূর হয়ে যায়।\n" +
            "(ত্বাবারানীর আওসাত্ব, ইবনে খুযাইমাহ, হাকেম, সহীহ তারগীব ৭৪৩)\n" +
            "\n" +
            "10.আবূ হুরাইরা (রাঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, প্রত্যেক সোনা ও চাঁদির অধিকারী ব্যক্তি যে তার হক (যাকাত) আদায় করে না, যখন কিয়ামতের দিন আসবে, তখন তার জন্য ঐ সমুদয় সোনা-চাঁদিকে আগুনে দিয়ে বহু পাত তৈরী করা হবে। অতঃপর সেগুলোকে জাহান্নামের আগুনে উত্তপ্ত করা হবে এবং তার দ্বারা তার পাঁজর, কপাল ও পিঠে দাগা হবে। যখনই সে পাত ঠাণ্ডা হয়ে যাবে, তখনই তা পুনরায় গরম করে অনুরূপ দাগার শাস্তি সেই দিনে চলতেই থাকবে, যার পরিমাণ হবে ৫০ হাজার বছরের সমান; যতক্ষণ পর্যন্ত না বান্দাদের মাঝে বিচার-নিষ্পত্তি শেষ করা হয়েছে। অতঃপর সে তার পথ দেখতে পাবে; হয় জান্নাতের দিকে, না হয় জাহান্নামের দিকে।\n" +
            "\n" +
            "জিজ্ঞাসা করা হল, হে আল্লাহর রসূল! আর উটের ব্যাপারে কী হবে?' তিনি বললেন, প্রত্যেক উঁটের মালিকও; যে তার  হক (যাকাত) আদায় করবে না-আর তার অন্যতম হক এই যে, পানি পান করাবার দিন তাকে দোহন করা (এবং সে দুধ লোকেদের দান করা)- যখন কিয়ামতের দিন আসবে, তখন তাকে এক সমতল প্রশস্ত প্রান্তরে উপুড় করে ফেলা হবে। আর তার উট সকল পূর্ণ সংখ্যায় উপস্থিত হবে; ওদের মধ্যে একটি বাচ্চাকেও অনুপস্থিত দেখবে না। অতঃপর সেই উটদল তাদের খুর দ্বারা তাকে দলবে এবং মুখ দ্বারা তাকে কামড়াতে থাকবে। এইভাবে যখনই তাদের শেষ দল তাকে দলে অতিক্রম করে যাবে, তখনই পুনরায় প্রথম দলটি উপস্থিত হবে। তার এই শাস্তি সেদিন হবে, যার পরিমাণ হবে ৫০ হাজার বছরের সমান; যতক্ষণ পর্যন্ত না বান্দাদের মাঝে বিচার-নিষ্পত্তি শেষ করা হয়েছে। অতঃপর সে তার শেষ পরিণাম দর্শন করবে; জান্নাতের অথবা জাহান্নামের।\n" +
            "\n" +
            "জিজ্ঞাসা করা হল, হে আল্লাহর রসূল! গরু-ছাগলের ব্যাপারে কী হবে? তিনি বললেন, আর প্রত্যেক গরু-ছাগলের মালিককেও; যে তার হক আদায় করবে না, যখন কিয়ামতের দিন উপস্থিত হবে, তখন তাদের সামনে তাকে এক সমতল প্রশস্ত ময়দানে উপুড় করে ফেলা হবে; যাদের একটিকেও সে অনুপস্থিত দেখবে না এবং তাদের কেউই শিং-বাঁকা, শিংবিহীন ও শিং-ভাঙ্গা থাকবে না। প্রত্যেকেই তার শিং দ্বারা তাকে আঘাত করতে থাকবে এবং খুর দ্বারা দলতে থাকবে। তাদের শেষ দলটি যখনই (ঢুস মেরে ও দলে) পার হয়ে যাবে তখনই প্রথম দলটি পুনরায় এসে উপস্থিত হবে। এই শাস্তি সেদিন হবে যার পরিমাণ ৫০ হাজার বছরের সমান; যতক্ষণ পর্যন্ত না বান্দাদের মাঝে বিচার-নিষ্পত্তি শেষ করা হয়েছে। অতঃপর সে তার রাস্তা ধরবে; জান্নাতের দিকে, নতুবা জাহান্নামের দিকে।\n" +
            "\n" +
            "জিজ্ঞাসা করা হল, 'হে আল্লাহর রসূল! আর ঘোড়া সম্পর্কে কী হবে?' তিনি বললেন, ঘোড়া হল তিন প্রকারের; ঘোড়া কারো পক্ষে পাপের বোঝা, কারো পক্ষে পর্দাস্বরূপ এবং কারো জন্য সওয়াবের বিষয়। যে ঘোড়া তার মালিকের পক্ষে পাপের বোঝা তা হল সেই ব্যক্তির ঘোড়া, যে লোকপ্রদর্শন, গর্বপ্রকাশ এবং মুসলিমদের প্রতি শত্রুতার উদ্দেশ্যে পালন করেছে। এ ঘোড়া হল তার মালিকের জন্য পাপের বোঝা।\n" +
            "\n" +
            "যে ঘোড়া তার মালিকের পক্ষে পর্দাস্বরূপ, তা হল সেই ব্যক্তির ঘোড়া, যাকে সে আল্লাহর রাস্তায় (জিহাদের জন্য) প্রস্তুত রেখেছে। অতঃপর সে তার পিঠ ও গর্দানে আল্লাহর হক ভুলে যায়নি। তার যথার্থ প্রতিপালন করে জিহাদ করেছে। এ ঘোড়া হল তার মালিকের পক্ষে (দোযখ হতে অথবা ইজ্জত-সম্মানের জন্য) পর্দাস্বরূপ।\n" +
            "আর যে ঘোড়া তার মালিকের জন্য সওয়াবের বিষয়, তা হল সেই ঘোড়া যাকে তার মালিক মুসলিমদের (প্রতিরক্ষার) উদ্দেশ্যে কোন চারণভূমি বা বাগানে প্রস্তুত রেখেছে। তখন সে ঘোড়া ঐ চারণভূমি বা বাগানের যা কিছু খাবে, তার খাওয়া ঐ (ঘাস-পাতা) পরিমাণ সওয়াব মালিকের জন্য লিপিবদ্ধ হবে। অনুরূপ লেখা হবে তার লাদ ও পেশাব পরিমাণ সওয়াব। সে ঘোড়া যখনই তার রশি ছিঁড়ে একটি অথবা দু'টি ময়দান অতিক্রম করবে, তখনই তার পদক্ষেপ ও লাদ পরিমাণ সওয়াব তার মালিকের জন্য লিখিত হবে। অনুরূপ তার মালিক যদি তাকে কোন নদীর কিনারায় নিয়ে যায়, অতঃপর সে সেই নদী হতে পানি পান করে অথচ মালিকের পান করানোর ইচ্ছা থাকে না, তবুও আল্লাহ তা'আলা তার পান করা পানির সমপরিমাণ সওয়াব মালিকের জন্য লিপিবদ্ধ করে দেবেন।\n" +
            "জিজ্ঞাসা করা হল, হে আল্লাহর রসূল! আর গাধা সম্পর্কে কী হবে? তিনি বললেন, গাধার ব্যাপারে এই ব্যাপকার্থক একক আয়াতটি ছাড়া আমার উপর অন্য কিছু অবতীর্ণ হয়নি,\n" +
            "\n" +
            "অর্থাৎ, যে ব্যক্তি অণুপরিমাণ সৎকর্ম করবে সে তাও (কিয়ামতে) প্রত্যক্ষ করবে এবং যে ব্যক্তি অণুপরিমাণ অসৎকার্য করবে সে তাও (সেদিন) প্রত্যক্ষ করবে। (সূরা যিলযাল ৭-৮ আয়াত)\n" +
            "নাসাঈর এক বর্ণনায় আছে যে, যে ব্যক্তিই তার ধন-মালের যাকাত আদায় করবে না সেই ব্যক্তিরই ধন-মাল সেদিন আগুনের সাপরূপে উপস্থিত হবে এবং তদ্দ্বারা তার কপাল, পাঁজর ও পিঠকে দাগা হবে; যে দিনটি হবে ৫০ হাজার বছরের সমান। এমন আযাব তার ততক্ষণ পর্যন্ত হতে থাকবে; যতক্ষণ পর্যন্ত সকল বান্দার বিচার-নিষ্পত্তি শেষ না হয়েছে।\n" +
            "(বুখারী ২৩৭১, মুসলিম ২৩৩৭, নাসাঈ, হাদীসের শব্দাবলী সহীহ মুসলিম শরীফের।)\n" +
            "\n" +
            "11.আবূ হুরাইরা (রাঃ) কর্তৃক বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যে ব্যক্তিকে আল্লাহ ধন-মাল দান করেছেন; কিন্তু সে ব্যক্তি তার সেই ধন-মালের যাকাত আদায় করে না, কিয়ামতের দিন (আযাবের) জন্য তার সমস্ত ধন-মালকে একটি মাথায় টাক পড়া (অতি বিষাক্ত) সাপের আকৃতি দান করা হবে; যার চোখের উপর দু'টি কালো দাগ থাকবে। সেই সাপকে বেড়ির মত তার গলায় ঝুলিয়ে দেওয়া হবে। অতঃপর সে তার উভয় কশে ধারণ (দংশন) করে বলবে, আমি তোমার মাল, আমি তোমার সেই সঞ্চিত ধনভাণ্ডার। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই আয়াত পাঠ করলেন, \n" +
            "অর্থাৎ, আল্লাহর দানকৃত অনুগ্রহে (ধন-মালে) যারা কৃপণতা করে, সে কার্পণ্য তাদের জন্য মঙ্গলকর হবে বলে তারা যেন ধারণা না করে। বরং এটা তাদের পক্ষে ক্ষতিকর প্রতিপন্ন হবে। যাতে তারা কার্পণ্য করে সে সমস্ত ধন-সম্পদকে বেড়ি বানিয়ে কিয়ামতের দিন তাদের গলায় পরানো হবে। (সূরা আ-লি ইমরান ১৮০ আয়াত)\n" +
            "(বুখারী ১৪০৩, নাসাঈ ২৪৪১)\n" +
            "12.মাসরূক (রহঃ) কর্তৃক বর্ণিত, আব্দুল্লাহ বিন মাসঊদ (রাঃ) বলেছেন, সূদখোর, সূদদাতা, সূদের কারবার জেনেও তার দুই সাক্ষ্যদাতা, কোন অঙ্গ দেগে নকশা করে দেয় এবং করায় এমন মহিলা, যাকাত আদায়ে অনিচ্ছুক ও টালবাহানাকারী ব্যক্তি এবং হিজরতের পর মরুবাসী হয়ে ধর্মত্যাগী ব্যক্তি কিয়ামতের দিন মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুখে অভিশপ্ত।\n" +
            "(আহমাদ ৩৮৮১, নাসাঈ ৫১০২, ইবনে খুযাইমা ২২৫০, আবূ য়্যা'লা ৫২৪১, ইবনে হিব্বান ৩২৫২, বাইহাক্বী ১৮২৪৭, সহীহ তারগীব ৭৫৭)\n" +
            "\n" +
            "13.আনাস (রাঃ) হতে বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যাকাত আদায় করে না এমন ব্যক্তি কিয়ামতের দিন জাহান্নামে যাবে।\n" +
            "(ত্বাবারানীর সাগীর ৯৩৫, সহীহ তারগীব ৭৬২)\n" +
            "\n" +
            "13.বুরাইদাহ (রাঃ) কর্তৃক বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, যে জাতিই যাকাত প্রদানে বিরত থেকেছে, সে জাতিকেই আল্লাহ দুর্ভিক্ষ দ্বারা আক্রান্ত করেছেন।\n" +
            "(ত্বাবারানীর আউসাত্ব ৪৫৭৭, ৬৭৮৮, হাকেম ২৫৭৭, বাইহাকী ৬৬২৫ অনুরূপ, সহীহ তারগীব ৭৬৩)\n" +
            "\n" +
            "14.ইবনে উমার (রাঃ) হতে বর্ণিত, আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, হে মুহাজিরদল! পাঁচটি কর্ম এমন রয়েছে যাতে তোমরা লিপ্ত হয়ে পড়লে (উপযুক্ত শাস্তি তোমাদেরকে গ্রাস করবে)। আমি আল্লাহর নিকট পানাহ চাই, যাতে তোমরা তা প্রত্যক্ষ না কর।\n" +
            "যখনই কোন জাতির মধ্যে অশ্লীলতা (ব্যভিচার) প্রকাশ্যভাবে ব্যাপক হবে, তখনই সেই জাতির মধ্যে প্লেগ এবং এমন মহামারী ব্যাপক হবে যা তাদের পূর্বপুরুষদের মাঝে ছিল না।\n" +
            "\n" +
            "যে জাতিই মাপ ও ওজনে কম দেবে, সে জাতিই দুর্ভিক্ষ, কঠিন খাদ্য-সংকট এবং শাসকগোষ্ঠীর অত্যাচারের শিকার হবে।\n" +
            "\n" +
            "যে জাতিই তার মালের যাকাত দেওয়া বন্ধ করবে, সে জাতির জন্যই আকাশ হতে বৃষ্টি বন্ধ করে দেওয়া হবে। যদি অন্যান্য প্রাণীকুল না থাকত, তাহলে তাদের জন্য আদৌ বৃষ্টি হত না।\n" +
            "\n" +
            "যে জাতি আল্লাহ ও তাঁর রসূলের প্রতিশ্রুতি ভঙ্গ করবে, সে জাতির উপরেই তাদের বিজাতীয় শত্রুদলকে ক্ষমতাসীন করা হবে; যারা তাদের মালিকানা-ভুক্ত বহু ধন-সম্পদ নিজেদের কুক্ষিগত করবে।\n" +
            "\n" +
            "আর যে জাতির শাসকগোষ্ঠী যতক্ষণ পর্যন্ত না আল্লাহর কিতাব (বিধান) অনুযায়ী দেশ শাসন করবে, ততক্ষণ পর্যন্ত তিনি তাদের মাঝে গৃহদ্বন্দ্ব অবস্থায়ী রাখবেন।\n" +
            "(বাইহাকী, ইবনে মাজাহ ৪০১৯, সহীহ তারগীব ৭৬৪)\n" +
            "\n" +
            "15.বুরাইদাহ (রাঃ) কর্তৃক বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যখনই কোন ব্যক্তি কিছু সাদকা বের করে, তখনই সে ৭০টি শয়তানের চক্রান্তকে ব্যর্থ করে দেয়। অর্থাৎ, যাকাত ও সাদকা বের করার সময় মানুষ শয়তান কর্তৃক চরমভাবে বাধাপ্রাপ্ত হয়।\n" +
            "(আহমাদ ২২৯৬২, ইবনে খুযাইমাহ ২৪৫৭, হাকেম ১৫২১, ত্বাবারানীর আওসাত্ব ১০৩৪, বাইহাক্বী ৮০৭১, সিলসিলাহ সহীহাহ ১২৬৮)\n" +
            "\n" +
            "16.ইবনে মাসঊদ (রাঃ) থেকে বর্ণিত, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কেবলমাত্র দু'টি বিষয়ে ঈর্ষা করা যায় (১) ঐ ব্যক্তির প্রতি যাকে মহান আল্লাহ সম্পদ দিয়েছেন, অতঃপর তাকে হক পথে অকাতরে দান করার ক্ষমতা দান করেছেন এবং (২) ঐ ব্যক্তির প্রতি যাকে মহান আল্লাহ হিকমত দান করেছেন, অতঃপর সে তার দ্বারা ফায়সালা করে ও তা শিক্ষা দেয়।\n" +
            "(বুখারী ৭৩, মুসলিম ১৯৩০)\n" +
            "\n" +
            "17.ইবনে মাসঊদ (রাঃ) উক্ত রাবী থেকেই বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম লোকদেরকে প্রশ্ন করলেন, তোমাদের মধ্যে এমন ব্যক্তি কে আছে, যে নিজের সম্পদের চেয়ে তার ওয়ারেসের সম্পদকে বেশি প্রিয় মনে করে? তাঁরা জবাব দিলেন, হে আল্লাহর রসূল! আমাদের মাঝে এমন কোন ব্যক্তি কেউ নেই, যে তার নিজের সম্পদকে বেশি প্রিয় মনে করে না। তখন তিনি বললেন, নিশ্চয়ই মানুষের নিজের সম্পদ তাই, যা সে আগে পাঠিয়েছে। আর এ ছাড়া যে মাল বাকী থাকবে, তা হল ওয়ারেসের মাল।\n" +
            "(বুখারী ৬৪৪২)\n" +
            "\n" +
            "18.আদী ইবনে হাতেম (রাঃ) বলেন, আমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বলতে শুনেছি, তোমরা জাহান্নাম থেকে বাঁচো; যদিও খেজুরের এক টুকরো সাদকাহ করে হয়! (যদি এক টুকরা খেজুরও না পাও, তবে উত্তম কথা বলে।)\n" +
            "(বুখারী ১৪১৭, মুসলিম ২৩৯৪)\n" +
            "\n" +
            "19.উম্মে বুজাইদ (রাঃ) বলেন, একদা আমি আল্লাহর রসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে বললাম, হে আল্লাহর রসূল! অনেক সময় মিসকীন আমার দরজায় দাঁড়ায়, কিন্তু আমি তাকে দেওয়ার মত কোন জিনিস পাই না। মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, যদি একটি পোড়া খুর ছাড়া দেওয়ার মত আর কিছু না পাও, তাহলে তার হাতে তাই দিয়েই বিদায় দাও।\n" +
            "(আবূ দাঊদ ১৬৬৯, তিরমিযী ৬৬৫)\n" +
            "\n" +
            "20.জাবের (রাঃ) কর্তৃক বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট এমন কোন জিনিসই চাওয়া হয়নি, যা জবাব দিয়ে তিনি না বলেছেন।\n" +
            "(বুখারী ৬০৩৪, মুসলিম ৬১৫৮)\u200E";




    String value;
    HadithDetailsFBinding hadithDetailsFBinding;

    @Nullable
    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, @Nullable ViewGroup container, @Nullable Bundle savedInstanceState) {

        hadithDetailsFBinding = DataBindingUtil.inflate(inflater, R.layout.hadith_details_f, container, false);
        View view = hadithDetailsFBinding.getRoot();
        value = getArguments().getString("value");

        return view;

    }

    @Override
    public void onViewCreated(@NonNull View view, @Nullable Bundle savedInstanceState) {
        super.onViewCreated(view, savedInstanceState);
        if (value.equals("1")){
            getActivity().setTitle(getResources().getString(R.string.hadith_iman));
            hadithDetailsFBinding.hadithDetailsTVID.setText(hadith_iman);
        }
        else if (value.equals("2")){
            getActivity().setTitle(getResources().getString(R.string.hadith_salat));
            hadithDetailsFBinding.hadithDetailsTVID.setText(hadith_Salat);
        }
        else if (value.equals("3")){
            getActivity().setTitle(getResources().getString(R.string.hadith_siam));
            hadithDetailsFBinding.hadithDetailsTVID.setText(hadith_Siam);
        }
        else if (value.equals("4")){
            getActivity().setTitle(getResources().getString(R.string.hadith_hazz));
            hadithDetailsFBinding.hadithDetailsTVID.setText(hadith_hazz);
        }
        else if (value.equals("5")){
            getActivity().setTitle(getResources().getString(R.string.hadith_jakat));
            hadithDetailsFBinding.hadithDetailsTVID.setText(hadith_jakat);
        }


    }
}
